{
  "pages": [
    {
      "text": "這篇的重點在於如何選購一個「好的螢幕」，我們儘量從淺顯易懂的應用出發，對於基礎知識與理論有興趣的朋友可以搜尋這些關鍵字。對於不同族群，好的定義是不同的，以選購螢幕來說，遊戲玩家需要反應快速，低殘影的螢幕，文書工作者需要俱備良好的護眼與閱讀模式的螢幕，而對於影像處理的人而言，則需要「色彩準確」的螢幕。\n若要說跟攝影器材一樣重要的東西，莫過於用來處理與修正照片的螢幕了，一個色彩正確的螢幕，是影像輸出的最後關卡，如果螢幕顏色不對，其產生的效應或許不會立刻浮現，但是卻會像滾小雪球般愈滾愈大，在一群拍照的人當中，真正重視顯色正確性的人恐怕是少數中的少數，如果您是一個非常重視自己所紀錄照片的人，攝影器材可以少，但正確的顯示設備(好螢幕+好校色器)卻不可少，因為到了遙遠未來的某一天，您會發現因為色彩不正確而造成調整錯誤的影像累積到不可收拾的地步。\n從很多專業的測試網站可以得知，就算是價格不菲的螢幕也是需要校色的，而且用來表示色彩正確度的DeltaE有時甚至還不小，這裡我們要先破除一些迷思:\n\n螢幕顏色的正確性與價格或品牌並沒有直接關係。\n一個價格高昂的螢幕，其反應的可能是用料的成本，與穩定度，耐用度的關係比較密切，保固服務等，但是並不代表不需要校色，相反的，有些高階螢幕甚至內建了校色器，這是因為隨著長時間使用，螢幕的元件，背光模組都會慢慢損耗，色彩也有可能因為使用者的環境，例如室內的光源而受到影響，從很多專業的測試網站可以得知，就算是價格不菲的螢幕也是需要校色的，而且用來表示色彩正確度的DeltaE有時甚至還不小，因此不是買了高價的螢幕回來就一勞永逸。\n\n\n賣場的螢幕不能顯示螢幕顯色的正確性。\n大部分的賣場用來展示螢幕的訊號源未必穩定，有些甚至是使用類比訊號，加上每台螢幕的預設值都不同，環境光源，與螢幕擺設的高度與位置都會大大影響觀看的效果，因此到大賣場去看螢幕的表現是非常不準的，甚至有可能被誤導。另外一個隱藏的陷阱，就是表現愈鮮艷的螢幕，對他的色彩正確性可能要打上很大的問號，因為他可能使用了特殊的顯示模式(例如電影模式)，雖然顏色很討喜，卻可能對校色造成不利的影響。\n\n\n因為別人的螢幕都沒有校色，所以自己的螢幕校色只是自己看得開心而已\n這是比較常聽到的說法，其實會這樣想的人，通常是不知道其實色彩是有一個標準的。\n撇開那些讓人眼花撩亂的規格，要找到一個適合影像處理的螢幕並不難，讓我們以校色的角度來分析一個好的螢幕應該具有的條件，校色的目的，無非是將螢幕校準到接近一個廣泛採用的標準，在這個前提下所有螢幕的色彩表現應該是會非常接近，校色後的螢幕會有兩個基本的改變，一個是Tone curve的改變，換句話說，除了Gamma產生變化，色溫也會跟著變化，因為Tone curve分別是Red，Green，Blue各一條。另外一個是色彩的轉換，這是透過XYZ Matrix轉換達到的，目的就是將有點偏差的顏色用螢幕本身能產生的正確顏色對應過去，在這兩個修正的作用下會產生一個副作用，就是損失色階，打個比方，一個從1排到256的骨牌，我們發現編號34的骨牌顏色並不正確，而是編號36的骨牌，因此我們將34到35的骨牌抽掉，以36替代34的位置，這樣一來，骨牌的數目就會變少了，要克服色階喪失的問題有兩種作法，一是一開始螢幕的色彩就十分準確，或只有少許的偏差，因此所需要的修正愈少，自然能保留更多的色階，另外一個，就是讓螢幕能產生更多的色階，例如增加位元數到10 bit甚至是12 bit，那麼即使是經過校色，其能呈現的色階仍然遠大於作業系統所能提供的理論色階數(一般情況下為8 bit)，色階損失的影響微乎其微，然而後者通常價位高昂(如醫療等級的顯示器)，因此更適合一般人的方法就是挑選一個跟校色標準接近的螢幕，所謂的校色標準，以sRGB為例:\n亮度(white level)約120cd/m2\n色溫(white point)為D65 (6500K)\nGamma 2.2\n較低的DeltaE\n因此只要螢幕硬體的表現愈接近這些參數，對我們的校色就愈有利，最近有愈來愈多螢幕評比，開始提供一些螢幕的基本測量參數，對消費者是一大福音，其實只要仔細觀察這些評比，會發現大多數的螢幕的確有機會調整到非常接近上述的基準，然而預設值卻往往偏離許多，例如某廣色域螢幕，其sRGB模式的Gamma為2.7，色溫為7500K，很明顯偏離sRGB許多，這樣的情況下去校色只會得到慘不忍睹的結果，有些評測網站，例如TFTcentral，會將螢幕的參數調整對應的真實數據列表出來，例如螢幕的Brightness值對應的真實亮度為何，這些資訊其實是極具參考價值，當然我們也可以自行使用校色器對螢幕的硬體進行測量，找出符合基準的硬體設定，但一來工程浩大，二來萬一沒有辦法找到合適的參數，那就代表這個螢幕根本上不適合進行校色，因此建議各位在選擇螢幕時特別注意上面幾項的表現。\nTFTCentral測試報告最令人激賞的一點就是，他直接會秀出符合基準的硬體參數設定值，例如亮度，色溫，以及Gamma值設定，直接使用他們提供的參數，通常可以得到接近基準的測量，省去自行測試的時間，比較要注意的應該是Gamma，有些螢幕的Gamma不管怎麼設定，就是無法接近2.2，因此這樣的螢幕可能就不是我們所要考慮的。\n(取消掉GW2760的數據，用TFTcentral的測試報告來顯示，重打數據)\n以我的Benq GW2760HS為例，他的預設色溫非常接近6500K，而將亮度調整到10左右時約為120cd/m2，同時，將Gamma參數設成2時則非常接近2.2，加上他的平均DeltaE就算不是前段班，也是中前段班，緊追在高階螢幕後面一點點，從這邊就可以判斷，這是一款適合校色的螢幕。有關亮度必須要特別補充，螢幕亮度通常是會浮動的，因此每次開機亮度可能都稍有不同，現在很多螢幕的出廠設定亮度都高達300cd/m2左右，遠超過我們的校正基準，必須要大幅調降亮度，然而很多螢幕的亮度調整是藉由PWM所達成，意思就是他是靠間歇性的開與關閉來達到亮度的調整，而不是真正的降低背光光源的亮度，間歇開關的間隔增加，透過人眼的視覺暫留就會有亮度降低的感覺，然而亮度愈低，就愈有可能使人感覺到閃爍而造成眼睛不適，這點在LED背光的螢幕上特別明顯，現在愈來愈多廠商開始力推所謂的不閃屏螢幕(例如華碩，Benq)，就是克服PWM調光所帶來的閃爍，因此建議選購時，以這些螢幕為優先考量。愈新款的螢幕，由於評測尚未出爐，我們無從得知硬體的真正表現如何，因此未必比已經上市一段時間的螢幕還有優勢，同時，上市已久的螢幕，也比較能了解可能會面對哪些問題，以及維修的狀況，畢竟穩定度與維修保固更是螢幕是否能順暢使用的關鍵。\n\n\n面板的選擇\n所謂的VA，IPS，TN等面板其實各有優缺點，例如VA面板通常有較高的對比，但是直視中心會有所謂的black crush效應以及潛在的面板不均勻問題(Gamma shift)，而IPS則有所謂的IPS glow，同時對比也比VA面板低，但是廣色域螢幕都是IPS面板居多，無論是VA面板的black crush或是IPS面板的IPS glow都是目前常見的問題，其實除了接受也別無他法，以面板來評斷螢幕的好壞其實是不太準確的，因此\n倒是對比度來說，VA具有比較明顯的優勢，對比對於影像的影響其實就是細節的呈現，例如相機的對比對焦，就是以對比度最大為對焦的基準，此時對焦區域的細節呈現的最清楚，要測量影像或是鏡頭的銳利度，也是以對比為測量對象(例如MTF-50)\n\n\n有關對比\n從color bit跟color depth來解釋對比度的差異，以實際的lum跟black lum來解釋為什麼對比愈高，細節愈明顯。(色階不連續也更容易察覺)\n\n\n有關色域\n\n\n有關護眼\n點距，螢幕尺寸，觀看距離，低藍光與PWM調光。輻射頻譜。\n螢幕對比，white level-black level/256，對比關係到細節的呈現(跟MTF/對比對焦)一樣也是用對比來表現銳利度。\n並不是買了支援aRGB的螢幕就好，實務上有很多難以克服的困難，Adobe RGB校色困難，因為光是testchart就超多(上千)\nsRGB校色可以很準確\nGamma的原理\naRGB跟sRGB都是RGB，在8bit裡都只能呈現256*256*256顏色，差別在於，同樣的R/G/B，對應的顏色有些許不同,例如0/255/0，aRGB跟sRGB的綠色是不同的，這就是兩者的差別\n色域空間愈大，應該要用愈高的bit來描述，才不會發生色階不連續的現象。", 
      "tags": "學習與閱讀", 
      "loc": "/posts/M43/color_1.html", 
      "title": "顯示色彩的奧秘 v0.1"
    }, 
    {
      "text": "有關Ptool的參數設定細節，請參考另一篇―Ptool的參數檔。\n更新軔體除了可以替日文機增加英文介面，提升錄影畫質，還能在PAL與NTSC規格切換；例如自香港平行輸入的繁體中文GX1，其為PAL規格，因此他只提供~25fps(1080p50或720p50)的錄影模式，同時還有30分鐘的錄影限制，經過軔體修改後，即可隨時在PAL與NTSC(~30fps,1080p30/i60或720p60等)間切換，也可以移除30分鐘錄影的限制，台灣與日本地區是屬於NTSC。早期PAL規格的相機，因為與台灣日光燈掃描頻率不同步，容易在室內錄影畫面中產生移動的條紋，這現象困擾著許多人，而NTSC規格比較不容易產生類似的問題，不過後期的機種已經能透過更改快門速度來解決這個問題了。\n\n這裡我們以GH2與GX1為例來進行軔體修改與升級的分解步驟，詳細的資訊請參考Ptool wiki的原文頁面:\n務必使用「充飽電力」的「原廠電池」，請勿使用副廠電池。\n請下載Ptool3，這是用來修改軔體參數的程式(ptool3.exe)。\n請下載GH2的官方軔體、GX1的官方軔體、或G3的官方軔體，我們將利用Ptool來更改軔體的參數(例如:GX1__V11.bin)。\n請下載Ptool的參數檔，由於參數檔隨時更新，我將其集中在另一篇討論(例如setc.ini)。\n確實檢查上述的步驟，並確保下載的檔案完整，我們即可開始進行軔體修改與更新的動作，如果參數檔設定錯誤，頂多是讓相機動作不正常(例如錄影中斷)，並不至於導致相機故障，以我在論壇的經驗，也未曾聽聞過類似事件，唯一有可能造成故障的因素是使用「未充飽」或「非原廠」的電池，嚴重者可能會造成無法正常開機，所以請大家謹記這個守則，更新前務必檢查電池並確實充電，同時不要在軔體更新過程中關閉相機電源或進行任何操作，就可以安心進行破解程序了。另外更新後的相機，請不要進入所謂的「工程模式」，會使相機運作不正常，諸如抓不到鏡頭，如果不小心進入工程模式，只要跳出工程模式後，按照下列步驟重新更新一次軔體即可恢復正常。\n由於中文字型是由相機上的ROM而非軔體提供，因此日文介面的Panasonic相機，在經過軔體修改後僅能出現英文介面，中文字型是無法正常顯示的，而原本已有中文介面的相機，更新軔體前後均不受影響，中文與各式語言介面都可以保留。\n以下是軔體修改的分解動作:\n\n\nWindows下直接執行ptool3.exe，Linux與Mac則安裝wine來開啟。\n\n\n\n點選Load Firmware後，讀取由Panasonic官方網站所下載的軔體檔(.bin檔，如果下載的是.exe執行檔，例如GX1__V11.exe，表示這個是壓縮檔，直接執行就能夠解壓縮成GX1_V11.bin檔案)。\n\n\n\n如果設定檔(.ini檔)與Ptool放在同一個目錄下，則讀取軔體後，下方A~J的按鈕會亮起綠燈，分別對應seta.ini~setj.ini。\n\n\n\n若要讀取setc.ini的設定，則用滑鼠左鍵點一下C的綠色按鈕即可將設定讀取進來，點選時會出現Settings loaded的提示字樣。\n\n\n\n檢查一下幾個重要的設定，例如Version increment一定要勾選，Interface與Movie related restrictions都勾選。\n\n有些相機需要將version increment設定成大於2的數字才能進行軔體更新，如果遇到無法更新軔體的情況，請將version increment的數值由1改為3(感謝York Chang網友發現這個問題)，這個設定是用來讓機身判斷記憶卡裡的軔體為新版本，如此才會進行更新的動作喔!!更新完後則以真正的軔體版本為主，也就是說，1.1版本的軔體，即使將version increment設成5，成功更新軔體後，版本仍然會維持1.1，透過這樣的機制，就可以不受限制的重覆進行軔體更新或還原軔體至初始設定。\n\n\n在專家設定裡，Scaling tables是與Quantization Parameter有關的設定。\n\n\n\n這些專家選項是畫質與檔案容量維持平衡的關鍵，相關的參數必須要經過耗時的測試才能得到。\n\n\n\n選擇Save Firmware，將修改過後的軔體檔存成GX1__V12.bin或GH2__V12.bin，將原來軔體編號加1即可，請勿將原始軔體覆蓋以備日後修改或還原。\n\n\n\n將一張由相機格式化過的SD卡連接上電腦，將剛剛的新軔體複製到記憶卡的根目錄。\n\n\n\n將SD卡插回相機，開啟電源，確保使用原廠充飽的電池，按下播放鈕(Playback)。\n\n\n\n如果是日文介面，則應該如圖所示，選擇第一個選項進行更新軔體。\n\n\n\n更新過程千萬不要中斷電源，或進行任何操作，放在安全的地方靜靜地等他完成。\n\n\n\n更新完後，版本應該不會改變。\n\n\n\n如果原本是日文機，更新完會多出語言選項，也會出現繁體中文的選項。\n\n\n\n但是中文字型是與軔體分開來的，也就是說，日文機身並不包含中文字型，所以即使出現中文選項，也無法正常顯示中文，所有的日文機應該都是這樣。\n\n\n\n因此如果您的相機是日文機種，還是選擇英文介面吧!\n\n\n\n如果是來自香港的平輸機器，機身已經包含中文字型，無論如何，中文介面都不會受到影響，可以安心使用。\n\n\n\n更新軔體有可能會遇到這樣的錯誤訊息，其實是因為機身切換了視訊格式，記憶卡裡的目錄結構也必須要有相應於NTSC或PAL視訊格式的改變，不需要太擔心。只要在相機上重新格式化SD卡，讓相機重新建立記憶卡的目錄即可。\n\n\n\n香港是採用PAL規格，可以利用這個選項切換成適於台灣的NTSC規格。\n\n\n\n這是GX1的設定，更改成NTSC即可。\n\n\n\nGH2也是一樣。\n\n\n\n更改成NTSC。如此一來，也比較能夠減輕室內日光燈下錄到閃爍燈頻的機率。\n\n更新完軔體後，請記得將SD卡根目錄下的軔體檔案刪除，不然下次開機按下播放鈕時，又會再次詢問是否要升級軔體喔!若想要還原軔體，只要重複上述步驟，僅點選version increment並設成3，其餘選項都取消勾選，即可將軔體還原回原廠的設定了。\nPtool的參數檔是標準的ini檔案，有興趣的人可以使用記事本或編輯器檢視裏面的內容，也可直接將設定值複製與貼上，在Ptool論壇裡也有許多不同的參數檔可供下載使用，建議大家有興趣可以多方嘗試，找出最適合自己的參數檔。", 
      "tags": "學習與閱讀", 
      "loc": "/posts/M43/ptool.html", 
      "title": "Ptool更新軔體程序"
    }, 
    {
      "text": "螢幕遮光罩可以阻擋室內光線投射到螢幕所引起的色偏，也能有效消除反光，例如我的電腦桌旁有一盞檯燈，平時可以感受到側面入射過來的光線，這些光線，除了會影響影像處理的色彩精確性，也會讓螢幕校色多了一些變數。\n遮光罩的好處不只是消除干擾的光源，他也有保護螢幕，防塵的功用，以往只有高階的專業螢幕才有遮光罩，而副廠的遮光罩也是價格不菲，尺寸與外觀也未必能找到合適的，因此以下分享如何自製不會受限於螢幕大小(這裡以27吋液晶螢幕為例)，可隨時拆卸，美觀又大方的影像處理專用遮光罩。\n\n我們需要的材料與工具如下:\n剪刀、美工刀、一般的雙面膠與普通膠帶。\n大尺寸的黑色珍珠板，最好事先量一下螢幕的長與寬，珍珠板的大小至少要比螢幕的兩倍面積還大，50元以內就可以在文具店裡買到很大的尺寸。\n黑色防震墊，具有厚度與彈性，可以彎曲，除了可以用來將遮光罩固定在螢幕上，還是目前測試過吸收光線最好的材質，完全不會有任何明顯的反光。\n防震墊可能比較不好找，卻是遮光罩成功與否的關鍵，其通常是放在手作包或相機包夾層裡作防震用途，因此賣手作材料的商店比較有機會找到，一片比我們所提到的珍珠板還大，卻只要100到150元之間，非常便宜，有興趣的人也可以上網拍搜尋看看，其實只要任何不會反光的材質都可以使用，購買前拿到日光燈下看看會不會反光即可得知。\n遮光罩的外型參考Eizo的高階螢幕CG系列，可以參考google圖片，搜尋Eizo CG即可看到圖案，您也可以自己設計喜歡的樣式，建議先用厚紙板做出板型，再用板型去切割珍珠板與防震墊，還可以重複使用喔。\n\n\n首先，我們將珍珠板裁成如上圖的樣式，以三片板子所構成的，符合螢幕的尺寸，用透明膠帶接起來，完成遮光罩的外殼。需要注意的是為了能順利彎成ㄇ字型，板子間要預留約1~2mm的細縫。\n\n\n\n在燈光下，黑色珍珠板仍有些許反光，因此內層必須貼上一層吸收光線的材質。\n\n\n\n這就是在手作店裡買到的防震墊，依照三片珍珠板的外型裁剪。然後使用雙面膠對齊貼在珍珠板上，要確定防震墊緊貼在珍珠板上沒有任何凸起。\n\n\n\n完成品如上圖，看起來好像是飛機的機翼，由於防震墊有厚度，只要將其寬度剪短一點，如圖露出珍珠板的部位，再貼上幾片固定用的小防震板，就可以輕易將遮光罩牢牢地固定在螢幕上，不需要任何黏膠，眼尖的您應該會發現我在預留寬度時中間的珍珠板露出空間最大，而兩片翼板露出的寬度則愈向尾端愈窄，這樣在掛上遮光罩時，其頂部遮光板會微微上仰，可以避免用久了下垂遮住畫面。\n\n\n\n兩片板子中間是用透明膠帶貼在一塊，上面再貼上防震墊，實際掛上去時這些痕跡都會被隱藏起來。從圖中也可以看到事先預留的細縫。\n\n\n\n用雙面膠貼上小片的防震墊，除了讓遮光罩更穩定的固定在螢幕上，也可以將一些可能漏光的地方擋住，貼片的位置的可以多多嘗試。\n\n\n\n記得隨時測試看看，如果發現無法順利彎成ㄇ字型，就必須用美工刀修剪一下。\n\n\n\n這裡放大板子的接縫處，夾在珍珠板(上)與防震墊(下)中間的是連接用的透明膠帶。\n\n\n\n掛在螢幕上，確保不會擋住螢幕畫面。\n\n\n\n由於螢幕的4個邊角經常是呈現圓弧形，若沒有這些小墊片阻擋就會察覺到漏光。從這邊可以看到防震墊吸收光線的能力非常優異，完全看不到反光。\n\n\n\n完成囉!!如果要掛上校色器，可以多設計一個小開口，或是稍微升高一下遮光罩即可，畢竟對校色影響最大的是來自上方與兩側的光源。\n\n以27吋螢幕為例，完成後無論是珍珠板還是防震墊都還有一半左右未使用，還可以用來做第二個遮光罩，尺寸更小的螢幕所需的材料會更節省。效果與外觀不輸給真正的遮光罩，重量也輕，運用自由度高，DIY的精神與成就感更是無價喔!", 
      "tags": "學習與閱讀", 
      "loc": "/posts/M43/monitorhood.html", 
      "title": "自製百元螢幕遮光罩"
    }, 
    {
      "text": "片幅對於照相有兩個直接的作用，一個是放大率，另一個則是裁切因子(Crop Factor)，兩者其實是息息相關的，而且會影響照片的視場。我們常聽到所謂相對於135片幅的「等效焦距」，也就是一顆鏡頭接在片幅大小不同的機身上必須換算焦距，其實「等效焦距」的說法容易讓人產生困惑，因此我們傾向區分為等效的水平與垂直視場，在開始解釋前，我們先將問題單純化，假設拍攝的主題與相機的距離是固定的，鏡頭也是使用同一顆，唯一變動的只有片幅的大小，這裡我們以三種常見的片幅尺寸為例，分別約為135 (36mm x 24mm)，APS-C (22.2mm x 14.8mm)，以及4/3 (17.3mm x 13mm)，135相當於最常見的35mm傳統底片大小，APS-C與4/3則是比135更小的片幅，其中135與APS-C的長與寬比例均為3:2，而4/3片幅如其名，長與寬的比例為4:3。同一顆鏡頭接在不同片幅的機身上，加上長寬比例的不同，會帶來完全不同感受的視場。\n\n\n\n\n假設上面這張照片是由135的片幅所拍的，那麼在其他拍攝條件維持不變的情況下，APS-C與4/3片幅可以拍攝的範圍如畫面中的白色框框所示，由於涵蓋的面積較小，無法完整紀錄整個畫面。\n\n\n\n如果我們把APS-C與4/3所紀錄到的影像範圍放大到全螢幕，與第1張135放大到全螢幕下相比，或是大家都沖洗成一樣大小的相片，前者會產生影像放大的效果，就如同使用了望遠的焦段一般，照片中的植物佔據畫面的比例愈大，放大的效果愈明顯，如果想要使用片幅較小的相機拍攝與135相同範圍的照片，就必須離景物遠一點。這就是「等效焦距」的原理。\n\nCrop Factor\n\n\n\n要計算等效焦距，一般是以片幅的對角線來計算，不過為了方便起見，我們採用片幅的長與寬，可以得到135的長寬(及對角線)約為APS-C的1.6倍,換句話說，面積約是2.56倍；代表要拍攝與135相同的範圍，APS-C得使用比原來的鏡頭還要更短的焦距(更廣角)，倍數剛好是1/1.6倍，也就是說，如果在135上使用28mm的焦段，APS-C要使用17.5mm (28mm/1.6)的鏡頭才能得到一樣的視場，這個1.6的倍率，如同圖中裁切畫面所產生的放大效應般，就是俗稱的裁切因子(Crop factor)，因為APS-C與135同為3:2的比例，無論是長、高、與對角線都是1.6的等比關係，因此以對角線長度的比率來求得裁切因子沒什麼問題，是很常見的作法。\n不過4/3片幅的情況就有點複雜了，他是4:3，因此對角線的計算方法並不能反應真實視覺變化，例如同樣對角線都是19吋的螢幕，你很難說服別人4:3的舊式螢幕與較新的16:9寬螢幕看起來感覺相同，對人來說，比例的改變所產生的感受變化是比對角線所提供的視場還要更明顯，要反應真實應用的情況，最好的方法就是分別討論長與寬的比率，例如一般人使用廣角鏡頭拍攝風景，比較在意的其實是水平的視野，而135的水平長度與4/3水平長度比率為2.08，高度的比率則為1.846，換句話說，水平視場的確是約2倍差距，但高度卻少於2倍，更接近於APS-C的1.6倍，也就是說，一個14mm的標準廣角鏡，可以提供等同於135下29.12mm的水平視野(Field of view)，以及25.84mm的垂直視野，如果你是重視水平視野的拍攝者，那麼4/3能提供的其實是稍窄於28mm的水平視場，但相對來說，垂直視場卻是比28mm更廣許多。。\n不過並不是每個4/3相機都適用上面的規則，現在新的4/3相機幾乎清一色都是Micro 4/3系統，他的特點就是鏡後距更短，捨去反光鏡，機身與鏡頭小型化等，除此之外，更出現了所謂「多比例感光元件(Multi-aspect sensor)」，提供比普通4/3片幅更大面積的感光元件，其4:3、3:2、與16:9比例下的對角線(面積)是一樣，不會因為裁切而喪失視場；我們可以用一個圓形來解釋這個概念，上圖可以看到多比例4/3感光元件呈現的不同比例，以紅綠藍顏色的框框標示之，只要個這些框框的4個角都落在圓周上，其對角線長度(面積)是相同的，要提供這樣的特性，就必須要使用面積更大的感光元件涵蓋各種不同的比例。\n從表中的數字可以知道，多比例的4/3感光元件，在3:2時Crop factor約為2.02，16:9時就不太適合使用Crop factor，以水平來看達到1.928，垂直則為2.27，對於拍風景的人來說，14mm的鏡頭可以達到相當於135的26.99mm (14*1.928) 水平視場，如果是一般的4/3感光元件，16:9或是3:2均為裁切，水平視場無論如何都只能達到相當於135的29.12mm (14*2.08)，若是是換成12mm的鏡頭，則約為24.96mm，與多比例片幅在14mm鏡頭上的差距只剩下2mm左右，片幅的些微差異所造成的影響可由此觀之。\n\n\n多比例感光元件對錄影的幫助\n\n\n\n如果是Full HD錄影，採用多比例感光元件的4/3相機更拉近與135片幅的距離，相對於裁切成16:9的135，GH2的水平與垂直比率來到了1/1.928，如果APS-C也裁切成16:9，則與GH2的差距變得更接近了(上圖)。\n如果與一般的4/3相機相比，例如GX1，在Full HD模式下(16:9)，水平範圍的差距約為1.928(GH2)比2.08(GX1)，這就是為什麼同樣是4/3片幅，不同相機間視場卻有些許差異，對於機身防手震的機種(例如Olympus品牌的機身)，其有效紀錄範圍勢必再縮小，這是因為要預留給防手震演算一些空間，同樣的桶狀變形的數位修正也會影響到視場，在變形修正的文章裡會提到，對於在12mm與14mm徘徊的消費者，可以將片幅差異與機身防震功能等的因素考量進去，或許就會發現兩者並沒有太大的差別，例如20mm的鏡頭在16:9下(多比例)，水平視場是接近38.56mm，相反的，17.5mm的鏡頭在一般的4/3機身上則水平視場約為36.4mm，這是橫拍的情境，對於直拍來說，4:3的比例或許比較有利的(無論是否為多比例)，因為他提供更寬的範圍，不過這裡並不是要驗證哪種模式是最好的，而是拍攝者根據當下的場景，以及拍攝角度(直拍或橫拍)，因時制宜變換不同的比例才能達到最大的功效。若要總結上面的資訊:\n非多比例感光元件的機身，如果可以事後裁切，以原生4:3比例拍攝較有利。\n多比例感光元件的機身，若有廣角需求，切換成16:9可以得到更廣的水平視場。\n多比例模式並不包含1:1，如果有1:1的需求，使用4:3紀錄再裁切較有利。\n片幅限制了鏡頭的最小體積，片幅愈小，鏡頭體積愈容易跟著縮小。\n目前具有多比例感光元件功能的只有Panasonic GH1與GH2。\n到這裡應該對於片幅與視場之間的關係有比較深刻的了解，片幅愈小對望遠端比較有利(在畫質不減損的情況)，大片幅則有近拍的優勢，當然事後裁切畫面也可以達到小片幅的效果，然而世界上並沒有完美無缺的事物，片幅愈大，代表透過鏡頭投射到感光元件的涵蓋範圍要愈大，鏡頭體積勢必不能太小，需要更大的口徑來彙集足夠的光量，鏡頭的重量與成本也會大幅增加，對於機動性與便利性來說並不是有利的因素，若強制縮小鏡頭的體積，則大大考驗光學的設計，也必須承擔邊緣影像品質惡化的風險。相對來說，片幅小到某種程度，像素感光能力將受到半導體製程的限制，同時鏡頭體積通常是比較小的，孔徑縮小，所能產生的散景效果也跟著受到限制，總而言之，不是愈大或是愈小就是最好，而是在各方面取得一個平衡點，例如同時考量鏡頭的體積--實體焦距愈短的鏡頭體積愈容易縮小，焦距愈長體積縮小的難度增加，加上這些要素，才是片幅與鏡頭之間真正需要仔細思量的地方。", 
      "tags": "學習與閱讀", 
      "loc": "/posts/M43/crop_factor.html", 
      "title": "片幅的奧秘 v1.1"
    }, 
    {
      "text": "Panasonic 20mm餅乾鏡對焦時，對焦模組的前後移動會使得螺牙的部位往內縮，平常使用沒有什麼大問題，然而裝上濾鏡轉接環後，就會產生卡死的危機。輕則無法正常對焦，重則有可能損壞馬達，解決的方法其實很簡單，就是裝上濾鏡轉接環時，預留點空隙，只要準備一條美妝店裡買得到的小橡皮筋就可以辦到喔!\n\n\n先來看看20mm餅乾鏡的前端，他的濾鏡口徑是46mm，螺紋機構（Lumix字樣上方）大約有2mm左右的寬度。實際使用時，這個機構會往內縮約0.5mm左右，因此只要保留1mm以上的間隙就可以了。\n\n\n\n\n準備像這樣的小橡皮筋，以及一把剪刀，橡皮筋不宜太粗(例如普通的橡皮筋)，以免裝上去後照樣產生卡死的問題。\n\n\n\n將橡皮筋剪去約1/3的寬度，注意不要剪斷掉了喔!\n\n\n\n把他套在濾鏡轉接環上，確保有2~3圈螺牙露出，就大功告成了喔！\n\n\n\n像平常使用一樣裝上轉接環，旋到底時會有阻尼感，利用橡皮筋的厚度，使其產生縫隙。\n\n\n\n側面看起來有如這樣，也就是至少有1mm左右的縫隙最為安全。也因為橡皮筋的阻力，轉接環不容易鬆脫。\n\n\n\n大功告成囉!可以看到鏡頭蓋是沿用14-45mm鏡頭的，口徑是52mm。\n\n\n\n使用轉接環的好處就是濾鏡選購單一規格即可，例如以手邊鏡頭最大的口徑為主，這個例子是採用46mm轉52mm的轉接環。\n\n\n\n可以看到鏡頭蓋與保護鏡都不必替換，直接使用52mm規格即可。\n\n一個小小的DIY，不但能夠讓鏡頭更安全地使用，還能減少出門攜帶的配件，諸如偏光鏡、減光鏡等可以讓所有鏡頭共用，更省下了添購不同口徑濾鏡的費用喔!", 
      "tags": "學習與閱讀", 
      "loc": "/posts/M43/20mm_filter.html", 
      "title": "DIY - 解決20mm餅乾鏡濾鏡轉接環卡死的問題。"
    }, 
    {
      "text": "來試試看攀岩吧!\n\n\n\n\n長大了。\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n媽咪~~上面沒有東西啦!!快點讓我下來啦!\n\n\n\n開車要專心...恩?", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130825.html", 
      "title": "Photo Diary - 2013/08/25"
    }, 
    {
      "text": "下雨天在家裡，好無聊，用把拔的褲褲來cosplay吧!\n\n\n\n\n頭巾是媽咪的傑作，今年夏天最新款式。\n\n\n\n變變變~~變身~~\n\n\n\n請配上魔法少女動畫變身的音樂。\n\n\n\n天氣熱，所以兄弟倆在家都一條內褲...//><//\n\n\n\n換弟弟，這是阿拉丁嗎?\n\n\n\n還有媽咪綁的耳環喔~\n\n\n\n重點部位都有遮好。\n\n\n\n啾一下~\n\n\n\n不是啾袋袋啦~\n\n\n\n齁齁齁~~把拔~~我美嗎?\n\n\n\n拿出媽咪好久以前去文具行買材料做的珠珠項鍊，立刻貴氣逼人。\n\n\n\n北拋拋~~幼咪咪喔~\n\n\n\n哥哥貢獻他的耳環。\n\n\n\n愈看愈覺得搞笑。\n\n\n\n下次再來cosplay吧!\n\n最近想到小孩在外被誘拐的問題，最好的方法不是教小孩「不要跟陌生人交談」，而是「不要跟陌生人離開」，而且實際演練是非常必要的，其實大部分的陌生人都是好人，只有少數是壞人，我們常常將小孩與他人隔離開來，其實是寧可錯殺一百(個好人)的作法，美其名是保護小孩，其實是限制了小孩與外界交流的能力，「不要跟陌生人交談」，等於是切斷了小孩對外界的求助管道，當遇到事情時，我們不可能一輩子都在他們身邊，懂得向他人求救自保才是最重要的，也才能避免真正的意外，這樣的教育，也會讓小孩更容易與他人合作，融入人群吧!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130901.html", 
      "title": "Photo Diary - 2013/09/01"
    }, 
    {
      "text": "由於破解軔體的步驟大同小異，我將其獨立於Ptool更新軔體程序一文，本文則不定時分享最新的破解參數設定，搭配Ptool則可進行錄影畫質的修改。\n\nDREWnet T9 (Trial 9) by Driftwood - 2013/07/26更新\n環境: GX1+Sandisk 45MB/s USH-I與GH2+Toshiba Class 10 23MB/s 白卡\n我使用Ptool論壇driftwood所調整的DREWnet T8錄影參數已經很久了，driftwood近期的設定檔算是Ptool論壇成立以來集大成之作，其畫質與檔案容量取得很好的平衡，同時long GOP的特性使得長時間錄影的穩定性高，而前幾天才釋出的DREWnet T9參數檔，使用了新的scaling matrix，對我來說是一大消息，也讓這篇Ptool的資訊分享延期。錄影畫質的破解，需要流量(bit rate, 8 bit=1 Byte)，Quantization Matrix，以及GOP互相配合，三者息息相關，與靜態照片不同的是影片檔經常是在1:1的情況下觀看的，因為當今主流螢幕所提供的解析度(大於或等於1920x1080)，就是為了能完整播放FullHD的影片，因此畫質的差別很容易以肉眼分辨，要達到良好的畫質，並不是無限上網地增加流量，而是在檔案大小與畫質間取得平衡，選擇DREWnet最重要的原因是其針對Scaling matrix做了許多調整，將流量平均分配給I/P/B frame，而非僅僅拉抬流量(通常也要設定auto quantizer)。流量過高往往也會降低錄影的穩定性，太複雜的場景容易使錄影中斷，因此在流量不過度暴增的前提下提升畫面的細節才是最聰明的辦法，在driftwood的描述裡，DREWnet T9具有以下特性:\n80Mbps constant in 24p modes for exceptional quality.\n1080i/FSH Maybe only around 40Mbps but the quantisation and PSNR is brilliant!\n720p modes Just the best there is. (事實上1080i/FSH(同時也是GH2的HBR以及GX1的FSH)所採用的scaling matrices跟720p是相同的)。\n由於平常我是GH2與GX1混合拍攝，為了將混合格式轉換禎率(pulldown)所需的成本降到最低，大多偏向採用1080p30(FSH)的錄影格式，使用DREWnet讓1080p30的錄影檔平均增加了約1.7倍的容量，對於生活錄影來說已經是很可觀的增長。24p無疑畫質更佳，但是所需的記憶卡空間也更多，如果各位拍攝影片的頻率非常高，例如紀錄小孩的成長，出外旅遊，同時還要兼顧靜態照片所需的額外容量，則FSH模式已經是綽綽有餘。不管是靜態還是動態攝影，「剛剛好」是很重要的原則。\n\n為了讓各位對於錄影畫質的提升有點概念，以下我們以光源較不充足的室內，GX1錄製的MTS檔1:1截圖來檢視之，使用FSH(1080p30)模式錄影。\n\n\n通常在充滿細節的畫面裡，最容易出現塊狀瑕疵，不過1:1檢視下，無論是椅子上的網點，還是布偶的毛料，DREWnet T9幾乎觀察不到色塊的存在。\n\n\n\n\n　 偽色或英文所稱的color banding最常出現在色階不連續的地方，其產生的不自然色彩，其實是macroblock所造成的，破解後的GX1，即使是低光下，皮膚的色階表現也很不錯。\n\n\n除了皮膚的色階表現良好，直線也不容易產生鋸齒，即使是動態場景(B/P frame)，表現也超乎想像的好。\n\n接著我們來檢視GX1原廠的MP4錄影，場景相同，流量為20Mbps。\n\n\n雖然GX1的MP4出廠值流量比AVCHD高(20Mbps比17Mbps)，很明顯全螢幕播放塊狀瑕疵一覽無遺。\n\n\n\n椅子的網格幾乎是糊成一團，對比DREWnet幾乎是完整呈現的紋理，差距實在是太大了。\n\n\n\n毛料也糊成一團，直線也出現鋸齒，Ptool對於MP4的破解並不完全，會造成機身無法正常播放，同時考量到記憶卡空間不夠時，也需要一個小巧的錄影格式，因此MP4的參數完全沒有更動，正常情況下使用MTS就足夠了。\n\n下面是上傳到youtube後全螢幕的截圖，當時還是使用DREWnet T8。\n\n\n上傳到Youtube後，影片會被轉成MP4格式，原始檔案保留的細節愈多，愈可以減輕畫質劣化的情況。\n\n\n\n這是原始的影片截圖，幾乎跟直接將靜態照片縮圖到FullHD大小的品質一樣!色階平順漂亮，細節保留完整。\n\n我還沒有時間好好觀察24p還有破解前後AVCHD畫質的差異，總括來說，只要Quantization的瑕疵不易被發覺，就達到破解的目了。真的要探究的話，下面列出driftwood對於DREWnet T8 量化的測試，其用一個灰階圖格來反映Quantization後的成像，顏色愈淡，表示影像品質愈好。\n\n\n此圖為GH2原廠的24p模式，在driftwood的測試裡排名第3。\n\n\n\n排名第2的則是GH3原廠24p模式(非All-I)。\n\n\n\n排名第1的是DREWnet與GH2，換句話說，已經超越了GH3非All-I模式所能達到的程度。\n\n當然，無論是使用DREWnet的GH2或是GH3，他們的硬體能力都還沒有被徹底發揮，例如driftwood的moon T7(ALL-I)可以說是跟GH3的All-I同性質的設定，採用的流量甚至遠遠超越GH3，Spizz與Nebula都是low GOP的設定，理論上畫質都比DREWnet還更上乘，有興趣的人可以嘗試看看，將來GH3能夠破解了，應該也能得到同等的品質，只是回到現實面，以及基於檔案容量與穩定性的考量，在生活紀錄這方面，DREWnet是我認為最平衡且最實用的參數設定，最大80Mbps的流量(約10MB/s)幾乎適用於所有class 10的SD卡，市面上大概只有破解的GH2，All-I模式下的GH3，還有高價位的專業錄影設備可以得到比DREWnet更佳的錄影畫質了。這也說明軟體的因素，在數位攝影裡經常是遠大於硬體的差別，同樣的觀念在探討網路照片的奧秘一文中也清楚地揭示。\n使用了兩天還沒發生任何問題，如果發生無法立即預覽影片的現象，只要重新開機就可以順利播放了，對影片檔本身是沒有影響的，有關T9的一些細節，Ptool論壇有很熱鬧的討論，有進一步的資訊再分享給各位囉！最後，錄影不是只有畫質的追求，還有拍攝手法，故事性，分鏡，以及畫面穩定度等，因此畫質「足夠」之餘，其他方面也是要努力兼顧喔!\nPS. 破解軔體前請確實閱讀Ptool軔體破解程序的需知，因為電源中斷導致機身變磚是不在保固內，請自行承擔風險喔~", 
      "tags": "學習與閱讀", 
      "loc": "/posts/M43/ptool_settings.html", 
      "title": "GX1與GH2破解設定資訊"
    }, 
    {
      "text": "咦~~把拔又在做奇特的東西!!\n\n\n\n\n準備cosplay的衣服，一針一線都要縫好。\n\n\n\n把拔還沒好嗎?\n\n\n\n無聊看一下窗外風景。\n\n\n\n媽咪買菜還沒回來。\n\n\n\n把拔~~好了沒?\n\n\n\n喔喔!!把拔完成了，竟然是電吉他。\n\n\n\n看我彈一首5月天，嚕嚕嚕嚕嚕~~~~\n\n\n\n好~~~好聽嗎?\n\n\n\n哥哥: 吉他上那個車輪真是可疑...。\n\n\n\n來組團吧!!就叫「Super糾咪」好了。\n\n\n\n「叮叮叮~登登登~咚咚咚~」\n\n\n\n「卡啦卡啦咖啦咖啦...」\n\n\n\n「弟弟，進入副歌solo了」\n\n\n\n「拉拉拉~~~嚕嚕嚕~~~」\n\n\n\n好~~好聽嗎?\n\n\n\n休息一下...吃點心~", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130831.html", 
      "title": "Photo Diary - 2013/08/31"
    }, 
    {
      "text": "哥哥最後一天上課，剛好碰到颱風天放假，公園旁河潮洶湧喔。\n\n\n\n\n提早到教室，今天是把把陪哥哥來上課，弟弟在家陪媽咪喔~\n\n\n\n最後一次的作品是偷取憤怒鳥蛋蛋的小豬(恩?..)。\n\n\n\n正在幫小豬黏上蛋蛋的哥哥(恩恩?)\n\n\n\n完成囉!!連同前幾次的作品一起帶回家。\n\n\n\n回程時在橋上欣賞湍急河流。\n\n有關憤怒鳥，根據沒玩過的把把敘述，就是一群遭受核廢料汙染的綠色豬(?)，為了解毒偷取了脾氣不太好的鳥們的蛋，因而引發了一場戰爭，可以參考這個影片:\n(是這樣吧?)\n這次實地全程參與了哥哥的課程，簡單來說就是老師一個口令一個動作，因此大家做出來的東西都差不多，不過哥哥上課時非常喜歡講話，大概會被認定是不乖的小孩吧!?期間老師說，豬的鼻孔是什麼顏色?是黑色的喔!因為裏面沒有燈泡所以黑黑的喔!...，結果哥哥突然爆出一句：「我鼻子有燈泡的話鼻孔會燒起來...」，當場害我「噗哈」一聲的笑出來，反而老師跟在場的家長都冷冷的繼續做他們的事，唉~~\n台灣，或許應該說大人們喜歡的教育或許就是這樣，不要問太多，照著做就對了，就算學會一堆「冷」知識，也變得無法活用，知識無法走出教室，難怪小孩的活力與創造力漸漸的被磨滅，想想我以前小時候，對於這樣的體制也是諸多抗議，因此像三民主義或是國文作文我總是0分起跳，根本是拒絕作答，能撐到現在也真是奇蹟啊!\n或許像這樣的課程，其實是上給父母心安的吧!?不過其實我們也不排斥繼續上那些課，只是其他家長跟老師可能要繼續忍受哥哥的冷笑話了!!哈哈!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130822.html", 
      "title": "Photo Diary - 2013/08/22"
    }, 
    {
      "text": "附近的公園在舉辦夜晚狂歡音樂園遊會，帶小孩們去晃晃。\n\n\n\n\n天啊!!滿滿一池黃色小鴨。\n\n\n\n弟弟，我來教你用釣竿釣鴨鴨。（總覺得好像有哪裡不太對)\n\n\n\n現場只有雷射光與遠方攤販的燈光，也不能用閃燈，拍起來非常克難，所以ISO盡情給他摧下去。\n\n\n\n看，我釣到了。\n\n\n\n滿滿的黃色小鴨!!回家可以進補囉!(啥!?..Q_Q)\n\n\n\n插在橋上的風車，哥哥!只能看不能拿喔!\n\n\n\n來吹吹看!\n\n\n\n弟弟，你生病了，我來幫你診斷一下（弟弟的表情...)\n\n\n\n望遠鏡~", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130811.html", 
      "title": "Photo Diary - 2013/08/11"
    }, 
    {
      "text": "阿公阿嬤跟大伯送的火車耶~~\n\n\n\n\n跟哥哥去買東西。\n\n\n\n呼~滿頭大汗。\n\n\n\n怎麼變成油頭小生了。\n\n\n\n\n\n\n家裡附近開了好漂亮的花喔~\n\n\n\n來個六連拍吧!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n雖然說是六連拍...表情不用那麼認真吧?=_=|||", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130824.html", 
      "title": "Photo Diary - 2013/08/24"
    }, 
    {
      "text": "今天稍微整理了以前的一些文章，發現當時照的圖解說明還真是隨便啊!!看來得重新照過了，現在重新看以前的文章，當年還陷入鏡頭銳利度與感光元件的迷思裡，真是感慨萬千，我想將舊的BLOG關閉也是有好處，就是重新審視自己的觀念;現在幾乎很少再比較那些有得沒有了，就連Photozone/Lenstip或是DxOmark/Dpreview也好長一陣子不去看了，那些資訊對於選購器材來說，心理因素其實是遠大於實質的用處，最後往往變成了敗家的藉口，但實情是，要照出好照片並不是靠帳面上的評比數據，而是真實的操作(良好的測光與構圖)，尤其是看過了許多糟糕的照片，都是號稱用高檔器材拍攝的，我漸漸對器材持保留態度，同時，我對坊間慣用商業攝影的手法(打光，後製)來誤導消費者升級器材的作為也不是很認同，但是消費者就是經常需要那些刺激，有需求就有供給，總之，沒有什麼東西是舊機器拍不出來的，人為的差異，經常是遠大於器材的差異，要得到好的結果，得先定下心來克服這層障礙才是，這個道理套用在任何事物都成立--或許就是所謂「有錢是買不到真功夫的」這句話吧?", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130816.html", 
      "title": "Photo Diary - 2013/08/16"
    }, 
    {
      "text": "逛完了子母隧道，還有點時間，我們去海邊玩一下沙吧!\n\n\n\n\n從崎頂車站旁的小路直接下去。\n\n\n\n海邊到囉!!\n\n\n\n海天一線，白茫茫的世界。\n\n\n\n\n\n\n風好大喔~\n\n\n\n\n\n\n\n\n\n耶~來玩沙吧!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n呸~弟弟吃到沙了。\n\n\n\n坐著吹一下海風享受陽光吧!(媽咪:囧~要曬黑了)\n\n\n\n哥哥一個人認真地挖沙。\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n回程時，當然不忘了比一下腳上的沙。\n\n\n\n沙灘的入口很隱密，被一堆草叢隱藏著。\n\n\n\n從這邊可以近距離看風力發電機。\n\n\n\n玩得差不多了，往火車站出發囉!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n回家囉~\n\n我們去的時候，旁邊的沙灘正在舉辦淨灘活動，隔個防波堤的這邊卻是非常乾淨，毫無人煙，我想過一陣子海水浴場開放了，遊客變多了，這些景象大概就比較難看到了吧!這次火車之旅，深深覺得最棒的地方總是最沒有人潮的地方!雖然最後兩個小孩都累得在回程的火車上呼呼大睡，對他們來說可是很難得的經驗，因為這次是憑著他們的雙腳走遍目的地，只要地點安全，交通方便，有機會再帶他們到鄉下去作深度之旅吧！", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130907d.html", 
      "title": "竹南火車之旅 - 2013/09/07 (四)"
    }, 
    {
      "text": "差不多中午了，前往竹南吃個午餐吧!\n\n\n\n\n離開前留個影吧!大家一起來金雞獨立。\n\n\n\n在竹南火車站前的飲料店，媽咪跟把拔在等傳說中甜到渴死人的黃金比例...。\n\n\n\n補充體力後，前往先前去過的崎頂站。\n\n\n\n這次我們要去的是子母隧道喔。\n\n\n\n留個影吧!\n\n\n\n觀海平台可以看到好漂亮的風景喔!!簡直就是日劇裡的場景。\n\n\n\n天氣一樣超好。\n\n\n\n沿著鐵道可以看到一座座高聳的風力發電機，真的是很奇妙的風景。\n\n\n\n上次來時這裡還是沙地，現在已經鋪了水泥了。\n\n\n\n在觀景台看到的風光。\n\n\n\n徐徐旋轉的大型風扇，彷彿可以聽到沈穩地「咻~咻~咻」的聲音。\n\n\n\n正在施工中的步道，似乎是為了即將開放的海水浴場與觀光客準備的。\n\n\n\n上一次時間很趕，所以子母隧道沒有去成，這次終於可以帶著悠閒的心情去走走。\n\n\n\n這是一條沿著鐵路的步道，可以近距離看到火車呼嘯過去呢!\n\n\n\n如果在天空的地方加些日文，大概可以充當電影海報吧!!哈哈!\n\n\n\n電影標題，鐵道的夏天!\n\n\n\n不知道為什麼，我還蠻喜歡拍電線桿。\n\n\n\n子母隧道到了!!\n\n\n\n裡面有工人在鋪地板，看來再過一陣子應該會有很多遊客吧?\n\n\n\n坑道裡回音此起彼落，工人還親切的跟我們說，繼續走下去還有隧道喔!\n\n\n\n以前這裡可是火車經過的地方呢!!後來就廢棄了。\n\n\n\n出了坑道，前面不遠處是第二個隧道。\n\n\n\n據說戰時這裡曾經有發生過激烈的戰鬥呢!\n\n\n\n牆壁上都是彈孔。\n\n\n\n繼續往裏面走，突然聽到頭頂有嘰嘰嘰的聲音，抬頭一看，竟然是一群蝙蝠倒掛在天頂，為了不驚動他們，小心翼翼地通過。\n\n\n\n哥哥在廢棄的鐵軌奔跑著。媽咪與弟弟則在隧道口的椅子上休息納涼。", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130907c.html", 
      "title": "竹南火車之旅 - 2013/09/07 (三)"
    }, 
    {
      "text": "在天橋上欣賞風景。\n\n\n\n\n空氣清新，還有一望無際的農田。\n\n\n\n往遠方看去是鄭漢步道，不過不在我們今天的行程裡。\n\n\n\n大夥兒沿著鐵路旁的小路邊散步邊欣賞風景。\n\n\n\n道路也很乾淨，大概是因為人煙稀少的關係。\n\n\n\n媽咪在灌溉渠道裡發現很多福壽螺耶~\n\n\n\n弟弟你到底在看哪裡啊？\n\n\n\n農田勾起了媽咪小時候的回憶!\n\n\n\n鐵路與鄉村風光。\n\n\n\n農作物變黃時應該會很漂亮吧?\n\n\n\n走得差不多了，往反方向晃晃吧!\n\n\n\n那顆粉紅色是福壽螺的卵耶!!把拔也是第一次看見。\n\n\n\n天氣好的不得了，幸好有帶遮陽傘出門。\n\n\n\n借用一下路邊灌溉用的抽水機洗個手。\n\n\n\n洗完手就要去下一站吃午餐囉!", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130907b.html", 
      "title": "竹南火車之旅 - 2013/09/07 (二)"
    }, 
    {
      "text": "這是孩子們第二次火車之旅，這次將造訪崎頂，竹南，跟談文這三個車站。\n\n\n\n\n全家起個大早，準備搭火車囉!\n\n\n\n弟弟正在啃他的早餐。\n\n\n\n在電聯車上，哥哥興奮地看著窗外。\n\n\n\n弟弟雖然有點不知道發生什麼事，還是高興的比Ya~\n\n\n\n大家在等火車開動。\n\n\n\n電車的窗外風景。\n\n\n\n突然一台電聯車呼嘯而過，哥哥被嚇了一跳。\n\n\n\n到了我們的第一站，談文火車站。\n\n\n\n這是一個無人車站，日式建築，有點年久失修。\n\n\n\n本來只有我們下車，意外的遇到另外一位老先生，跟我們一樣好奇地穿梭這個車站。\n\n\n\n這是個歷史悠久的車站，裏面可以看到很多有趣的東西喔!\n\n\n\n稍做休息，爬上了天橋，這裡可以看到一望無際的鐵路與農田喔!\n\n\n\n大家來留個影吧!!弟弟正在認真地爬著樓梯。\n\n\n\n咦，哥哥在角落發現了什麼?\n\n\n\n是螳螂耶~\n\n\n\n還有以為是枯葉差點踩下去的蛾(好險)", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130907a.html", 
      "title": "竹南火車之旅 - 2013/09/07 (一)"
    }, 
    {
      "text": "在路口轉角等紅綠燈時拍的。\n\n\n\n\n同樣的地方換個角度。\n\n\n\n出門時看到的，好像一隻兔子在玩跳箱。\n\n\n\n路過隨拍。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130805.html", 
      "title": "Photo Diary - 2013/08/05"
    }, 
    {
      "text": "前進~Go~Go~Go\n\n\n\n\n跟媽咪玩捉迷藏。\n\n\n\n有回音：喔~喔~喔~\n\n\n\n跟路過的小朋友招手。\n\n\n\n休息一下，喝點水吧!\n\n\n\n哥哥換你喝。\n\n\n\n歸途一隅。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130810d.html", 
      "title": "Photo Diary - 2013/08/10 (四)"
    }, 
    {
      "text": "去散步囉!\n\n\n\n\n看看橋下的魚。\n\n\n\n走到河邊看看吧!\n\n\n\n哥哥好奇地撿了個樹枝。\n\n\n\n\n\n\n可以待在河邊看很久。\n\n\n\n波光粼粼。\n\n\n\n弟弟想要丟草給魚魚吃。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130810c.html", 
      "title": "Photo Diary - 2013/08/10 (三)"
    }, 
    {
      "text": "帶弟弟去買東西，途中經過公園。\n\n\n\n\n坐著休息一下吧!看看來來往往的路人。\n\n\n\n\n\n\n\n\n\n路旁開了好漂亮的花喔!\n\n我想這世界上的東西總是可以分成兩類，一是「不能」，另一個則是「不知」，一字之差可達十萬八千里，我想「不知道可以做到」不代表「不能做到」，相信「不能」者，大概只能一翻兩瞪眼，凡事莫可奈何，沒有什麼比這個更輕鬆的了，而「不知」者則辛苦多了，因為需要去嘗試，去學習才能得到答案。幸好這個世界總不是這麼單純，當一個人兩手一攤說不行就是不行，大部分的情況，並不是真的不行，而是不知道可行，而這一絲絲的希望，總是留給勇於去嘗試與轉變的人吧!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130810b.html", 
      "title": "Photo Diary - 2013/08/10 (二)"
    }, 
    {
      "text": "家裡上了年紀的老狗狗。\n\n\n\n\n快來看，把拔又做了驚人的東西，這次是電腦喔!\n\n\n\n呃...這台電腦看起來好像是廟裡來的，不過配備齊全喔~看!!右邊那個是滑鼠，左邊凸出來的是主機。\n\n\n\n現在正在播放狗狗猩猩馬賽克版。\n\n\n\n啊啊~發生了一點意外，螢幕破了個大洞...=_=|||", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130810a.html", 
      "title": "Photo Diary - 2013/08/10 (一)"
    }, 
    {
      "text": "自從天天帶相機出門後，就開始發現生活中微小又切確的幸福，一天中有很多雜事要做，有時為了生活，為了處理心頭上煩悶的俗事，漸漸地也對其他事物、對生活感到麻木，就如同在高樓環繞的都市空間或狹小的辦公室裡生活慣了，隨時低頭於手中的平板，手機，抬頭則是望著電視機或電腦螢幕，久了就忘記寬廣天空的存在，想像力與感受力也就漸漸地消失了。\n對我來說，在繁忙的腳步聲中稍作停留，放空於眼前的景物是一件很重要的活動，他讓我重整凌亂的步伐，稍作喘息，也讓我隨時記得世界的廣闊，生活的意義，在那種時刻，就是我冥想思考的時候。每天通勤走的路線大同小異，因此同樣的地方一遍又一遍的經過，不過卻也讓人感受到時間對於生活周遭的影響，反而讓我特別喜歡不斷地回到同個地方拍照，上面這些照片，不知道照了多少回，然而每次都有不同的感受。\n中秋假期跟老婆重看了「異形」第二集，真是經典呢!那時還沒有什麼電腦特效，所有場景都是模型搭起來的，或是靠演員去扮演怪物，但劇情還是緊張刺激，以現在的眼光來看仍然是很優秀的電影，只是少了一些「波瀾壯闊」的大場面而已；反而之後一卡車同樣的外星人追殺類型的電影就愈來愈了無新意，劇情愈來愈公式化，看過就忘，真是令人感嘆啊!\n看異形第二集真是讓人意猶未盡，不過眼尖的老婆還是立刻發出吐嘈點：「為什麼開飛機要帶墨鏡..?」(我:對厚!!)", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130731.html", 
      "title": "Photo Diary - 2013/07/31"
    }, 
    {
      "text": "今天的動手作主題是我的把拔呦~\n\n\n\n\n弟弟:「咦!又是小饅頭!!看我配溫開水快速解決!」\n\n\n\n哥哥開始畫雛型...\n\n\n\n我的身體...\n\n\n\n我的觸手..阿不是...是我的手\n\n\n\n接近完成了，還有愛心耶!!(翻白眼中...)\n\n\n\n旁邊同學的媽媽們都好忙喔!\n\n\n\n完成囉!!還有鋼鐵人的動力爐喔!!\n\n\n\n弟弟:「飽...還沒吃完」（媽咪偷偷多塞了一包)\n\n\n\n弟弟的啾啾嘴。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130801.html", 
      "title": "Photo Diary - 2013/08/01"
    }, 
    {
      "text": "八八節兵分兩路，弟弟留下來陪把拔，哥哥跟媽咪回南部跟阿公過節。\n\n\n\n\n跟表姊一起到巷口串門子。\n\n\n\n鄰居養的喵咪，完全不怕生。\n\n\n\n這是阿爸小時候常玩的釣魚玩具，跟表姊一起玩。\n\n\n\n來跟表妹一起玩。\n\n\n\n還有好吃的天然芒果冰沙!!好冰喔!\n\n\n\n回程遇到返鄉人潮，哥哥跟媽咪只能站在車廂的入口處，站好久腳好酸喔!\n\n\n\n雖然累到不行，但還是可以讓媽咪開心一下，你看我變成豬鼻子喔!", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130803b.html", 
      "title": "哥哥回南部過八八節 - 2013/08/03"
    }, 
    {
      "text": "逛完湖，去大草坪走走吧!\n\n\n\n\n先跟新成員打個照面，把拔，狗狗胖胖的喔...\n\n\n\n小心翼翼地在草地上走著。\n\n\n\n雖然失焦了，卻很喜歡這張。\n\n\n\n東逛逛西逛逛。\n\n\n\n跟老樹根合照一張吧!\n\n\n\n時間差不多了，等公車中。\n\n\n\n跟弟弟說，很大的車車就是我們要搭的車喔!\n\n\n\n回家前弟弟開心的留影。", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130803ad.html", 
      "title": "弟弟去踏青 - 2013/08/03 (四)"
    }, 
    {
      "text": "休息夠了，我們去湖邊看看吧!\n\n\n\n\n弟弟一直停下來看路邊的花花草草。\n\n\n\n前方有鴨群大舉經過。\n\n\n\n呱呱呱~好久不見的雁鴨。\n\n\n\n一隻雁鴨偷偷的瞄向我們(食物判定..無)。\n\n\n\n走吧!!朝下個食物據點邁進。\n\n\n\n第一次看到雁鴨目瞪口呆的弟弟。\n\n\n\n鵝也來了，呱呱呱(食物呢?)\n\n\n\n蹲在湖邊欣賞動物們的弟弟。", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130803ac.html", 
      "title": "弟弟去踏青 - 2013/08/03 (三)"
    }, 
    {
      "text": "踏青的地點到囉!!咦?那是什麼?\n\n\n\n\n先找個涼快的地方坐一下吧!\n\n\n\n弟弟好奇地東張西望。\n\n\n\n果然是很熱，我們到下一個納涼的地點吧!\n\n\n\n\n\n\n呼...有冷氣真好。", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130803ab.html", 
      "title": "弟弟去踏青 - 2013/08/03 (二)"
    }, 
    {
      "text": "媽咪帶哥哥回南部幫阿公過八八節了，今天跟把把單獨去踏青囉!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n防曬準備就緒，出發囉~", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130803aa.html", 
      "title": "弟弟去踏青 - 2013/08/03 (一)"
    }, 
    {
      "text": "5/23更新，有人提到以GH2錄影時，60i或60p比24p還流暢，其實是忽略了錄影階段shutter speed才是真正的影響因素，不然現今的電影錄製(24p)都不能應用在動作片上了。GH2比GX1以及其他類似的相機方便的地方就是，他的shutter speed是可以手動選擇的，GX1則只能在1/50s,1/60s,1/100s,以及1/120s間切換，至於其他不能手動調整快門速度的相機呢?我猜frame rate是多少，快門速度就固定是多少吧!另外，日光燈下的水波紋也是跟shutter speed有關，例如GX1的PAL機身，只要將shutter speed設成1/60s的倍數，就可以消除60Hz電壓頻率下日光燈的閃爍紋。那為什麼有人會強調只有NTSC的機身才能消除呢?原因在於這些機身的shutter speed都是固定在frame rate的倍數無法調整， 總而言之，GX1以後的Panasonic M43相機應該就不會再有PAL或NTSC的日光燈水波紋問題了，最後內文小更新有關高frame rate對slow motion的幫助。\n5/10更新，把一些該加上去的連結都補上了。\n\n開始前，先麻煩各位惡補一下interlaced跟progressive的分別，以及field(場)與frame(影格，禎)的區別\n可先參考wikipedia，而以下的解釋都以NTSC為例，如對應到PAL，請將30p/60i/60p或30fps改成25p/50i/50p及25fps:\n首先我們先認識一下各個FHD/HD的寫法，根據EBU的規範:\n\n1080i60表示1920x1080 interlaced, 60 fields per second，其中奇與偶數field組成一個frame\n1080i/30表示1920x1080 interlaced, 30 frames per second，跟1080i60未必是等價的\n1080p/24表示1920x1080 progressive, 24 frames per second\n720p/60表示1280x720 progressive, 60 frames per second\n\n以此類推，然而1080p/30，1080p/60都是最早的AVCHD 1.0的規範裡尚未制定的，如果數位相機或錄影機的sensor output本身可以輸出30p 該如何是好呢?\nGH2的HBR或是GX1的AVCHD裡的1080i60就是這個情況下的產物，在這兩個模式下，sensor output都是30p (30 frames per second, 30fps)，那麼要如何將30p包裝到60i的格式裡呢?\n最簡單的方法就是將30p的每一個frame複製成兩個一模一樣的field，每個field還是一樣只有奇數行或偶數行，只是來源是同一個畫面，就可以用60i的格式儲存30p的內容，如此一來也不需要去交錯，即使影片播放軟體辨認成60i的影片，他仍是貨真價實的30p，這個方法稱為progressive segmented frame(PsF)，在progressive的螢幕上播放(LCD--液晶螢幕)，不會有任何交錯格式的現象產生。這就是為什麼如果GX1可以破解流量，將可以非常逼近GH2的HBR模式。\n要辨認這個1080i60是否為PsF的方式包裝30p的內容，必須從廠商所提供的規格去了解，例如說明書裏面寫到:\n1080i60, sensor output 30fps\n就表示這是用30p的輸出儲存到1080i60的格式裡，也就是貨真價實的1080p/30，例如GX1的說明書，還有GH2的國外官網對HBR模式都是這樣註明的。\n而GH2的說明書裡寫的是1080i60, sensor output為60i，表示sensor output為60fps，是貨真價實的60i，也就是兩個完全不同畫面的field，因此在非交錯掃描的播放設備上會出現鋸齒狀的交錯瑕疵，如這個網址的畫面:\nhttp://www.100fps.com/\n在原生交錯掃描的CRT(映像管)電視機上，播放真實60i的影片是效果最好的，因為他的掃描頻率就幾乎是60Hz(正確來說是59.94Hz)，以奇數行畫面與偶數行畫面的順序交互秀出，因為這個特性加上人眼視覺暫留，不會察覺到任何影像呈現的問題，同時還能用30p的頻寬實現60 fps，這其實是一個很聰明的方法，然而現在這種CRT螢幕已經愈來愈少了，現今大部分的播放設備，例如LCD都是屬於Progressive的方式(不分奇偶行，也就是只能呈現一個完整的frame)呈現畫面，因此60i的影片在播放上會出現問題，需要模擬交錯掃描，也就是所謂「去交錯(deinterlacing)」要做的事，去交錯有分blender, interpolation,跟doubler，根據使用的演算法不同，最後得到的frame rate其實會不同，例如blender的frame rate可能為30 frames per second(30fps)，而doubler的frame rate則為60 frames per second(60fps)，有人認為60i為30 frames per second，其實是不太正確的(即使是NTSC的wiki說明也點不周全，容易產生誤導)，他的畫面錄製仍然為60fps(60 fields/s)，每一個field都來自一個獨立的畫面，只是後端播放時，會根據去交錯的方法而變成30 frames per second或60 frames per second。\n因此GH2的1080i60完全是針對交錯掃描的CRT而生的，而其HBR模式以及GX1的1080i60則骨子裡是真的1080p/30，只是為了考量現有播放設備的相容性，以60i的格式包裝30p的內容。那麼錄影時shutter speed/angle要如何選擇呢?\n如果是GH2的1080i60，則1/120s為180度 shutter angle，也就是每個field曝光一半的時間，因為sensor output是60 fields per second，同理可推，60p為1/120s，24p為1/48s；如果是GH2的HBR或GX1的1080i60，則1/60s為180度 shutter angle(每個frame曝光一半的時間)，因為sensor output都是30 frames per second，1080i60(非PsF)為1/120s而非1/60s的原因是在錄製階段，是要看field而不是看frame，因為frame rate是可以在播放端決定，而且所謂的field才是真正獨立的畫面，因此shutter angle的計算式要用field rate而不是frame rate的。事實上，Shutter speed的設定效果遠大於frame rate或field rate的選擇，例如有人會說24p有「電影感」，其實是nonsense(不好意思，筆者以前也說過電影感這種話)，只有shutter speed的設定才會造成影片的流暢與停頓感，就算都設在180度shutter angle，30fps跟60fps的畫面凝結感與曝光度也不同，與其執著於shutter angle設成180度，不如考量shutter speed對畫面真正的影響，才不會落入shutter angle的迷思，因此我都建議別人多試試不同的shutter speed。真的想要有電影的流暢感，請以1/48s的shutter speed為界限調整。而實情更有可能是--真正的電影感是不存在的。\n較快的shutter speed，會讓畫面的停頓感更顯著(英文叫stutter)，容易凝結流動中的物體，例如水滴，而較慢的shutter speed，則容易產生動態殘影(motion blur)，有時反而不容易察覺到畫面的停頓而覺得流暢許多，同時shutter speed也會決定一個field/frame曝光的程度，是跟光圈與ISO值連動的。因此適時的調整shutter speed對於錄影來說是一件重要的事。另外要提到的是，理論上shutter angle大於360度就等於每個frame/field均完整的曝光，例如24p的shutter speed無法低於1/24s，HBR無法低於1/30s，不過有趣的是，如果將GH2的手動錄影模式設成720/60p，則shutter speed可以慢到1/30s，相當於720 shutter degree，這個問題就算是筆者去Ptool論壇詢問也沒有人給出答案...。\n那麼24p, 30p, 60p(frame rate)真正影響的是什麼呢?有兩個層面，一個是播放端的更新頻率，例如LCD為60Hz, CRT可能為72Hz，那麼24p在60Hz的設備上播放就產生同步的問題，同理，30/60p在72Hz的設備上也有同步的問題，這個就跟播放軟體，顯示卡，以及螢幕間的設定與協調有關，小弟的建議是使用60Hz設備的人儘量用30/60p，或是將24p轉成30/60p也是可以(2-3 pulldown)，在播放與處理影片面臨的問題最小，另一層面則是frame rate愈小，panning的果凍效應(jello effect)也會愈明顯，這是因為GH2/GX1是採用Rolling shutter的機制紀錄畫面，因此拍動作的場景可以使用GH2的720p/60格式(sensor output 60fps)大幅改善直線搖擺的問題，而GX1的720p/60的sensor output還是30 fps，因此果凍效應跟切換到1080i60模式(PsF)是差不多的，另外60p/i的錄製，對於slow motion的後製效果也比較好，因為每秒取得的畫面更多。\n而1080p/60是屬於AVCHD2.0的規範，由上可知無論是1080i60或是1080p60都可以涵蓋1080p30的影片內容，因此看不到真正有關1080p/30的規範，未來的播放與錄影設備應該會漸漸朝向1080p/60發展。\n希望以上一次釐清所有跟錄影模式有關的問題。", 
      "tags": "學習與閱讀", 
      "loc": "/posts/M43/shutter-angle.html", 
      "title": "GH2/GX1 - 24p, 60i, 30p, 還有60p，以及快門速度(shutter speed or shutter angle)的關係(v0.1)"
    }, 
    {
      "text": "這個角度以前有照過，沒想到這次又照了一次幾乎一樣的。\n\n\n\n\n\n\n\n\n\n\n弟弟來爬好漢坡吧!\n\n\n\n耶依秀~~~\n\n\n\n弟弟完全停留在原地。\n\n\n\n\n我一直覺得自己的注意力有限，很容易被本質以外的東西所迷惑，因此最近努力督促自己排除讓人分心的事物，專注在自己覺得最重要的事情上，我想就好像拿相機紀錄親子生活，若過度專注在器材上，反而容易忽略了眼前的景物，若太注重眼前的構圖取景，反而又失去了當下親子互動的寶貴時光，如果這樣看來，是否應該以親子互動為優先，拍照次之，器材才是最後呢?照這樣看，過於強大的器材，龐大的體積，豐富的按鈕...等，似乎變得只是扯後腿而已，與紀錄的本質背道而馳，而太著重於攝影技術，是否也會變得只能拍出一張張唯美但制式的照片，雖然得以贏得掌聲與喝彩，拍攝者卻往往置身於事外，少了參與互動的真實感受？我想一張照片並不能算是真正的回憶，努力活在當下才是，而且任何事都適用這個道理吧!\n或許要改善這個情況，就是開始限制按快門的頻率，少照一點相，多留點時間給眼前的人兒們，就像這個篇文章所呈現的，其實真正值得保留的照片就這幾張而已。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130726d.html", 
      "title": "Photo Diary - 2013/07/26 (四)"
    }, 
    {
      "text": "今天弟弟充當愛手作的媽咪的小模特兒，把把偷偷在後面把兩人拍下來。\n最近又開始狂看教養的書籍，我心目中的幸福之路，並不是在照片裡，而是在實際的生活互動裡，每次看了教養的心得，總覺得我這個做爸爸的還有很長的路需要努力，我想作父母的，不是給孩子任何像「孩子，我只要你快快樂樂，安安穩穩地長大」這類的期許，但是補習，填鴨還是一個都不少，而是給自己「做父母的，有責任跟孩子一起學習與成長，教育就是父母的責任，包括教育自己」這樣對自身的期許，因此，與其在這邊說什麼，不如好好跟孩子聊些什麼，好好想想該讓自己充實些什麼，多花點心思在家人身上，父母才是教養的重點。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130726.html", 
      "title": "Photo Diary - 2013/07/26 (三)"
    }, 
    {
      "text": "這是要拍沐浴乳廣告嗎?\n\n\n\n\n這是要拍洗面乳的廣告嗎?\n\n\n\n這是要拍包包的廣告嗎?\n\n\n\n住家附近新開了一間挫冰店，來去試吃看看。\n\n\n\n挫冰還沒來，就被冷氣冷到了。\n\n\n\n來吃吃看芒果挫冰，好吃耶!\n\n\n\n吃完來去公園運動一下吧!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130726b.html", 
      "title": "Photo Diary - 2013/07/26 (二)"
    }, 
    {
      "text": "這裡紀錄著我學習的過程與心得，沒有廣告的干擾，儘可能呈現最乾淨舒適的閱讀版面，當您一進入這個網站，畫面上只會出現最新的文章，如果發現右下角的箭頭亮起來，表示可以瀏覽下一篇或上一篇文章，此外，也可以點選上方歷史存檔或文章分類等選項查詢其他文章喔！\n\n\n留言系統提供方便的圖案插入與分享連結功能，可以使用twitter/google/Facebook等帳號登入，目前暫時不開放匿名留言，討論與留言請遵守網路禮儀喔！\n\n\n您可以使用RSS訂閱本網頁，不過比較推薦加入我的Facebook ，我會定期將更新文章的訊息放上去，舊文章更新時也會一併在Facebook上通知，不會因為RSS的靜態訂閱而遺漏。\n這裡的文章是採「自由書寫」的模式進行撰寫，因此一篇文章會隨著時間而產生不同的面貌，如果各位覺得文章有錯誤，疏漏，不清楚的地方，歡迎留下您的意見，作者會盡力回答或修正問題，也歡迎抓錯字與不通順的句子喔！對於反應文章問題的朋友，在此深深地致上感謝之意！讀者的意見是筆者持續寫作的動力。\n\n\n本站文章以遵照姓名標示、非商業性、禁止改作之創用CC方式發佈，如要轉載文章請留言通知作者，並完整保留作者(文遠爸)與出處，謝謝。", 
      "tags": "mathjax,about", 
      "loc": "/stories/about.html", 
      "title": "關於這裡 (v0.1)"
    }, 
    {
      "text": "很久以前就想要利用Raspberry Pi(以下稱RaspPi，中文叫「樹莓派」)這樣的ARM電腦來做網路伺服器，我的目的是家裡跟工作場所的檔案都透過rsync與該伺服器進行同步，伺服器再與Dropbox進行同步，等於是無論在哪裡，都可以取得一致的工作檔案，達到多重異地備份的目的，這個BLOG也經由它deploy網頁與照片到github pages，同時也具有了版本控制的性質，也就是說，除了多台電腦同步，異地備份，還加上了時光回溯與分支的特色，本身它還是個Web server，用來自動產生重要的資料報表(我是想應用在投資理財上面)，讓我隨時可以透過網頁檢視這些圖表；一開始我是拿一台很舊的AMD K7桌上型電腦實作這些功能，用了快半年效果的確很不錯，不過機殼又大又重，耗電量也大，總不是那麼方便，不能隨時帶走，上個星期家人回台灣，我訂了一塊RaspPi想要送給他們的小孩玩，卻陰錯陽差等到昨天才寄到，錯過了碰面的時間，考慮了一陣子，決定自己先留著用用看吧!不然對方從來沒有使用過Linux，一開始就讓他們被一堆指令嚇到也不是很好。其實RaspPi的設計初衷，就是儘量壓低成本，讓世界各地的兒童都能接觸歷久彌新的電腦知識與開放的程式語言，而非大多數由商業公司掌握的技術與軟體，這塊板子可是連大人都沉迷於其中呢!在歐美跟日本也是大受歡迎的喔!\n先前試過Arch Linux、ubuntu、OpenSuSE與Mint，總覺得Debian系的作業系統親切感十足，因此RaspPi的Raspbian幾乎是無痛上手，快速地用家裡的電視機開機，記下了網路卡的卡號，隔天到工作的地方用DHCP給了個動態IP，之後就再也不需要螢幕了(當然連桌面也省了)，就連我現在回到家裡，也是用終端機遠端連線繼續進行安裝與設定作業，因此下面也只分享一些RaspPi的外觀，也沒什麼桌面或是截圖好秀的，真的要給個概念的話，就是您現在所看到的文章與網站，日後將會以RaspPi作為發佈的來源。\n\n\n100元的壓克力機殼，RaspPi可以超頻，因此重要的晶片都黏上散熱片，目前是超到950MHz，發熱量並不高，不需要風扇散熱，長時間運作應該是沒問題。\n\n\n\n\n旁邊是USB跟RJ-45網路埠，由於主要的網站都是放在github上，因此對於網路頻寬的需求沒有那麼大。\n\n\n\n話說我本來想利用HDMI轉接D-SUB來接家裡的電腦螢幕，無奈到賣場一看，一個轉接頭竟然都快比RaspPi還貴，因此還是翻箱倒櫃挖出一條AV端子，接上家裡許久未開啟電源的電視機，反正只要網路先設定好，之後都以遠端連線來操作即可。\n\n\n\n這是RaspPi的背面，可以看到SD卡槽，SD卡安裝後會凸出許多，算是美中不足的地方。\n\n\n\n壓克力盒可以打開，可以看到GPIO針腳以及視訊介面。\n\n\n\n可以看到HDMI接頭，可惜家裡沒有螢幕可以接(是的，我們家的螢幕都很古老)。\n\n說來慚愧，現在正是智慧型手機當道的時期，然而我跟老婆還在使用最古老最基本的2G通訊手機，我們常自嘲是智慧手機白痴，對我來說手機只要打電話功能做得好就夠用了，待機時間長，不漏接來電，訊號良好才是比較重要，看到許多人花太多時間在手機上也讓我們有所警惕，RaspPi算是我們家第一台ARM系統，其實之前更吸引我的是對岸的Cubieboard2/Cubietruck，因為他CPU已經升級到A20(雙核)，又有SATA介面跟Flash記憶體，整體規格高出RaspPi許多(價格也貴些)，不過RaspPi可用的資源與週邊還是比較多，穩定性也不錯，例如視訊模組，GPIO跟Arduino都是我接下來想玩的，同時我也想看看他的效能是否已能達到我的要求，之後才來評估是否需要效能更高的小主機，目前的感覺是不跑圖形介面則綽綽有餘。等這「塊」伺服器正式運作後，我可能還會再買一塊，然後把小孩玩壞掉的遙控車改裝一下，加個視訊；一個高級電子時鐘；寵物跟嬰兒房的監視器;或是弄一個平台讓小孩盡情地玩Linux這個作業系統，體積跟耗電量一小，就多出了太多可能性與應用，我想我應該是愛上了這塊小主機，當然Python可是他的主力程式語言喔!!最可惜的大概是GPU不支援OpenCL，不然就更能夠發揮他所有的運算資源了。\n一些值得推薦的RaspPi教學與資源:\nRaspberry Pi的奇幻漂流 (初學者必看喔!有很多安裝教學)\n葉難的Raspberry Pi筆記 (翻譯很多書籍的前輩，有很多不錯的心得與資源分享)\nㄆㄜ ㄊㄧㄡ ㄙ (屬於比較高階的應用，他的賣場還蠻值得逛一逛，本身也是個電子/電路高手)\nThe MagPi (好像看到當年骨灰時代的電腦雜誌，薄薄的一本，卻讓人一看再看，超級有親切感啊!)\nRaspberry Pi Official Website (不用解釋，就是官方的網站)\n台灣樹莓派 (台灣經銷商)", 
      "tags": "自由的程式人生", 
      "loc": "/posts/Coding/raspberry_pi_case.html", 
      "title": "Raspberry Pi 使用體驗"
    }, 
    {
      "text": "哥倆好一對寶。\n\n\n\n\n雖然有時會吵架，不過大部份的時間裡兩人都相處的不錯。\n\n\n\n哥哥很喜歡的木頭益智積木，是舅媽跟舅舅送的喔!\n\n\n\n媽咪買菜回來囉!來幫忙剝蕃薯葉吧!\n\n\n\n兩人的睡姿。\n\n兩個小男生共處一室，一定會有爭來爭去的時候，一旦發生這種事，父母的仲裁影響是很深遠的，我們家的規矩是不可以隨便搶走別人的東西，一定要詢問過對方，弟弟比較不懂，經常會哭著要搶哥哥手中的玩具，不過我們並不認為哥哥一定要讓弟弟，這種長幼有序的觀念其實沒有在我們家落實，同時，玩具也不應該每個人都給一份，弟弟想玩哥哥手中的玩具，一定要哥哥答應，或是等哥哥玩完了才可以換他玩，我想這樣不會讓年紀稍大的小孩覺得我們總是偏袒年紀小的，也能讓年紀小的懂得與他人互動的基本道理，兩人也會了解到資源其實是有限的，不是率性要求就可以得到的，對我來說，要一改權威式的教養也的確辛苦，要考慮的事情很多，並不是單純的罵一罵就可以了事，要教他們平等待人，也要教他們心平氣和地處理自己與他人的情緒，自己也要心平氣和，冷靜地介入爭執，平等的對待他們，沒有人有所謂的特權，把自己降到他們的高度去跟他們對話，需要的是更大的耐心，因此父母的身心狀態也是很重要的一件事。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130726a.html", 
      "title": "Photo Diary - 2013/07/26 (一)"
    }, 
    {
      "text": "", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130728.html", 
      "title": "Photo Diary - 2013/07/28"
    }, 
    {
      "text": "哥哥上課囉!今天是作粘土勞作。\n\n\n\n\n弟弟一如往常，坐在後面由小點心伺候。\n\n\n\n今天點心提早吃完(媽咪:(驚)怎麼那麼快就吃完了？)，弟弟想下來走走。\n\n\n\n粘土熊熊翻白眼中...\n\n\n\n凸凸眼黏好了喔!!本來那顆黑黑的是其中一個鼻孔，但是另外一顆掉了，暫且當他是痣吧!\n\n\n\n還有蝴蝶結，原來這個熊熊是女生，幫小熊黏上一閃一閃的夜總會霓紅燈。\n\n\n\n弟弟好想湊到前面去看喔!(看在我溫開水配小饅頭快速解決的份上)\n\n\n\n完成囉!!上次的外星孔雀魚也發回來了，這次的作品就叫「夜總會歹痣大條的瑪莉蓮夢熊」吧!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130725.html", 
      "title": "Photo Diary - 2013/07/25"
    }, 
    {
      "text": "路邊的含羞草，這是兩兄弟第一次親眼看到的喔!\n\n\n\n\n因為樹叢太高了，弟弟墊著腳尖想看河道下施工中的怪手。\n\n\n\n哥哥大叫:弟弟！這裡看的到啦！來這邊看。\n\n\n\n夕陽下的光輝，哥哥正在倒著走路。\n\n\n\n帶著兄弟倆下去近距離看一下，日後似乎會開放給民眾直接走到河邊的樣子。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130616a.html", 
      "title": "Photo Diary - 2013/06/16 (一)"
    }, 
    {
      "text": "弟弟站在旁邊陪阿嬤炒菜。\n\n\n\n\n兩兄弟最愛畫畫了。\n\n\n\n這裡有好多畫畫的工具喔!!可以盡情的塗鴉耶！\n\n\n\n我看看，哥哥你又在畫外星孔雀魚了嗎?\n\n\n\n彈鋼琴，抖~~~~~蕊~~~~~蜜~~~~~花~~~~~收~~~~~\n\n\n\n喂？你找阿公阿嬤啊!!可是我是弟弟啦!!你打錯了!\n\n\n\n阿公阿嬤，我可以把電話帶回家玩嗎?\n\n\n\n來玩乒乓球。\n\n\n\n飛啊!!我是鹹蛋超人~\n\n\n\n阿公阿嬤家真好玩。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130720.html", 
      "title": "Photo Diary - 2013/07/20"
    }, 
    {
      "text": "上課囉！今天老師教的是畫孔雀魚。\n\n\n\n\n哥哥一付躍躍欲試的樣子，而弟弟在後面突然發現旁邊的人不是媽咪(驚!!??)，媽咪跑去拍哥哥啦!。\n\n\n\n先畫草稿，幫孔雀魚加上豬鼻子。\n\n\n\n埋頭刻啊刻~~\n\n\n\n然後加上水藍色的海。\n\n\n\n彗星出現囉!!長長的掃帚尾。\n\n\n\n地球發射巨大的雷射光啦!!\n\n\n\n阿湯哥:「外星人來了!!塊陶啊~~」\n\n\n\n孔雀魚的觸手快畫完了...。\n\n\n\n接近完工囉!外星人入侵地球!\n\n\n\n弟弟哀怨地擺臭臉吃著準備好的小零嘴(我也想畫啦!)。\n\n\n\n完成了!咦？怎麼有個小朋友來湊熱鬧？\n\n\n\n每次課程結束了都可以領貼紙喔!!哥哥最喜歡把它貼在大腿上。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130718.html", 
      "title": "Photo Diary - 2013/07/18"
    }, 
    {
      "text": "", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130717.html", 
      "title": "Photo Diary - 2013/07/17"
    }, 
    {
      "text": "隨著天色愈來愈暗，家裡的光線也愈來愈昏暗了，趁著天還沒完全黑，媽咪趕快去煮晚餐。\n\n\n\n\n已經有點暗了，幸好家裡有蠟燭，來個燭光晚餐吧!\n\n\n\n弟弟第一次看到蠟燭，他說：「喔依依...大竹耶~~」\n\n\n\n喔喔!!天愈來愈黑了，等一下吃完要趕快去洗澡，不然會暗迷摸喔~~\n\n\n\n好不容易在燭光下快快洗完，天已經完全黑了，這張照片是把把用手動對焦加相機的閃光燈拍的，事實上當時幾乎是完全沒有光線的喔!\n\n\n\n時候尚早睡不著，來玩點玩具吧!外面好安靜喔!!也沒有把把媽咪敲鍵盤的聲音，好像與世隔絕般。\n\n\n\n陪他們玩了一整天，終於有點累了；由於沒有電，臥室有點悶熱，因此把棉被跟枕頭搬來和式房睡吧!\n\n\n\n哥哥發明的袋鼠怪手。\n\n\n\n晚上大家窩在和式房的窗戶邊，吹著涼風入睡，第2天接近中午就恢復供電了，對兩兄弟來說應該是個難忘的回憶吧!", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130713d.html", 
      "title": "蘇力颱風停電 - 2013/07/13 (四) 完"
    }, 
    {
      "text": "弟弟我來幫你裝電池吧!!\n\n\n\n\n玩車車過山洞的遊戲。\n\n\n\n哥哥好愛這台跑車喔!\n\n\n\n前進!!\n\n\n\n雖然不太會操縱，但是愛不釋手啊!!想當年把把那個時代，遙控車可是非常稀少呢!", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130713c.html", 
      "title": "蘇力颱風停電 - 2013/07/13 (三)"
    }, 
    {
      "text": "台南阿公一共送了兩台喔!兩人愛不釋手。\n\n\n\n\n不過蒐集了家裡的電池，只夠一台使用。\n\n\n\n那就選這台大黃蜂跑車好了。\n\n\n\n弟弟說他想要裝電池。\n\n\n\n可是只剩一顆啦!!怎麼辦?", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130713b.html", 
      "title": "蘇力颱風停電 - 2013/07/13 (二)"
    }, 
    {
      "text": "蘇力颱風過境快到中午時，突然大跳電，電燈忽明忽暗，連電腦也開不了機，整條街都是這樣。\n\n\n\n\n這是兄弟倆第一次遇到停電喔!持續了一整天，一直到隔天早上才恢復。\n\n\n\n由於電力不穩，索性把電燈都關掉，沒有電燈，房間裡有點昏暗，因此把餐桌移到窗戶邊，吃午餐囉!\n\n\n\n開動囉!今天的午餐是滷肉飯。\n\n\n\n吃完午餐，休息一下，不知道要玩什麼，把阿公送的遙控跑車搬出來吧!", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130713a.html", 
      "title": "蘇力颱風停電 - 2013/07/13 (一)"
    }, 
    {
      "text": "哥哥的第1堂粘土課，要做刺蝟喔!\n\n\n\n\n整場只有他是站著的，算是很新奇的體驗。\n\n\n\n連弟弟也來湊一腳。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130711e.html", 
      "title": "Photo Diary - 2013/07/11"
    }, 
    {
      "text": "下午下了場大雨，涼爽了許多，雨停了，來去放風箏囉!\n\n\n\n\n媽咪先試試看!飛呀!!其實沒有什麼風，因此要一直跑。\n\n\n\n弟弟遠遠的看著媽咪跟哥哥跑來跑去。\n\n\n\n草地有點溼，弟弟不太想動。\n\n\n\n哥哥倒是非常興奮，邊跑邊叫。\n\n\n\n照完這張照片後，哥哥就仆街了，不過馬上爬起來又跑回來。\n\n\n\n下雨了，不過雨還沒很大，來吹個泡泡吧!\n\n\n\n剛開始吹沒多久，雨就愈下愈大了，只好回家囉!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130707.html", 
      "title": "Photo Diary - 2013/07/07"
    }, 
    {
      "text": "", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130704.html", 
      "title": "Photo Diary - 2013/07/04"
    }, 
    {
      "text": "來玩變裝秀吧!!我是潛水夫。\n\n\n\n\n重點部位要遮好。\n\n\n\n兄弟倆在家無聊沒事做。\n\n\n\n新玩具，來排個賽車跑道吧!\n\n\n\n看哥哥手忙腳亂地把跑道排起來。\n\n\n\n準備~出發~~Go~Go~Go!\n\n\n\n第一次失敗，跑道垮了，再試一次!\n\n\n\n兩人同心協力(不過弟弟負責破壞就是了)\n\n\n\n雖然看似簡單的積木，但是玩法有很多種喔!\n\n\n\n排好囉!!你看哥哥一臉滿足!(連把把跟媽咪都搶著玩呢!!)", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130701d.html", 
      "title": "Photo Diary - 2013/07/01 (四)"
    }, 
    {
      "text": "中午去幫媽咪買東西，順便試試新買的帽帽。\n\n\n\n\n這樣看起來很冷嗎?\n\n\n\n比個招牌姿勢吧!\n\n\n\n公園一個人也沒有，因為是中午啊!!\n\n\n\n這時才發現帽子不往上翻一點，會有陰影耶!真是失策!!\n\n\n\n不過能避免中暑才是最重要的，看起來防曬效果不錯。\n\n\n\n哥哥最愛玩的泰山遊戲!\n\n\n\n雖然哥哥玩得高興，但是我卻快熱昏了。大致玩完一輪就跟他說把把快不行了!!我們快點回家吧!!...", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130701c.html", 
      "title": "Photo Diary - 2013/07/01 (三)"
    }, 
    {
      "text": "不過要怎麼玩呢?\n\n\n\n\n看著我發呆中。\n\n\n\n\n\n\n好啦!!來看一下說明書吧!\n\n\n\n哥哥也一起研究，哇，有好多種排法喔!\n\n\n\n來堆高高看看。\n\n\n\n小心翼翼...完成囉！(弟弟想用脖子把球夾住)", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130701b.html", 
      "title": "Photo Diary - 2013/07/01 (二)"
    }, 
    {
      "text": "為了外出準備的遮陽帽。\n\n\n\n\n天氣熱幫狗狗剃毛，媽咪還在頭上剃了個愛心喔！\n\n\n\n弟弟的頭髮不用靜電就可以豎起來了。\n\n\n\n啥?你在說我嗎?最近語言大爆炸，經常語出驚人。\n\n\n\n來玩舅媽送的積木囉~", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130701a.html", 
      "title": "Photo Diary - 2013/07/01 (一)"
    }, 
    {
      "text": "打預防針，大腿痛痛。\n\n\n\n\n不過醫生阿姨有給我一顆勇氣糖果。\n\n\n\n吃西瓜囉~你看這姿勢...。\n\n\n\n哥哥也吃得滿臉都是。\n\n\n\n吃得整身都是。\n\n\n\n裝酷的哥哥、小企鵝與弟弟。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130630c.html", 
      "title": "Photo Diary - 2013/06/30 (三)"
    }, 
    {
      "text": "星期六早上，在家裡陪他們堆積木。\n\n\n\n\n今天來堆馬馬吧!\n\n\n\n雖然腿短了點，但是還蠻有模有樣的。\n\n\n\n加上嘴巴就大功告成囉!\n\n\n\n外面太陽好大啊!!等傍晚再出去散步吧!\n\n\n\n弟弟新發明的接球方法。\n\n\n\n汗滴貢貢流喔~~~\n\n\n\n什麼時候冬天會來呢?", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130630b.html", 
      "title": "Photo Diary - 2013/06/30 (二)"
    }, 
    {
      "text": "弟弟洗澡時玩針筒水槍。\n\n\n\n\n今天的晚餐是媽咪的咖哩燴飯，吃得滿臉都是。\n\n\n\n是吃到壞掉的香菇嗎?\n\n\n\n噢耶~~有大西瓜可以來消暑囉。\n\n\n\n嘴角都還沾有咖哩，下次再叫媽咪煮一次吧!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130630a.html", 
      "title": "Photo Diary - 2013/06/30 (一)"
    }, 
    {
      "text": "我們先來看看下面四張長與寬最大640px的圖，其來源都是同一張相片:\n\n\n原始圖檔縮小至640px，上傳至github。\n\n\n\n\n原始圖檔上傳至google相簿，以640px呈現。\n\n\n\n原始圖檔上傳至Flickr相簿，以640px呈現。\n\n\n\nImagemagick 縮圖至640px並銳化，上傳到github。\n\n接著來看800px解析度下的結果:\n\n\n原始圖檔直接縮小至800px，上傳至github。\n\n\n\n原始圖檔上傳至google相簿，以800px呈現。\n\n\n\n原始圖檔上傳至Flickr相簿，以800px呈現。\n\n\n\nimagemagick 縮圖至800px並銳化，上傳至github。\n\n不知道各位比較喜歡那一種呈現方式呢?\nimagemagick的參數如下:\n\nconvert 原始圖檔.jpg -colorspace RGB -filter LanczosSharp -distort Resize 800x800 -unsharp 1x0.55+1.5+0.002 -colorspace sRGB -border 10 -quality 100 縮圖檔名.jpg\n\n縮圖最重要的兩個環節，就是避免鋸齒化以及像素捨去(down sample)所產生的模糊化，這兩者無論是對於靜態影像或是動態影像都是非常重要的，對於去鋸齒化，我們參考Nicolas Robidoux [1]教授所建議的參數，使用distort Resize搭配-filter LanczosSharp，LanczosSharp其實是屬於Windowed SincFast演算法，可以用Verbose模式將細部的設定列出，例如在命令列下達:\n\nconvert null: -filter LanczosSharp -define filter:verbose=1 -resize 2 null: | grep '#'\n\n則會顯示:\n\n# Resize Filter (for graphing)\n#\n# filter = SincFast\n# window = SincFast\n# support = 3\n# win-support = 3\n# scale_blur = 0.981251\n# practical_support = 2.94375\n\n這就是LanczosSharp的細部參數。所謂的縮圖，其實跟tensor transformation有關，因為一張圖其實就是以一個龐大的矩陣儲存影像資訊，有關SincFast演算法可以參考Resampling Filters [2]這方面的資訊。\n而對於銳化這部份，效果比較好的是使用Gaussian Mask，類似的方式如Smart Sharpen [3]或unsharp mask，使用Photoshop或GIMP即可針對畫面線條的邊緣進行銳化，而跳過色階變化平滑的區域(例如膚色，或是天空)，這樣一來，就不會一併將雜訊銳化而造成不自然的雜點，unsharp mask這詞是來自於傳統底片式攝影所使用的暗房技術，目的是得到邊緣銳利化的結果，在數位影像裡，透過將原圖減去一定比例的模糊化影像，所得到的差異影像(邊緣)疊加回原圖，以造成邊緣銳利化的效果，在imagemagick裡我們使用-unsharp這個參數進行圖檔的批次處理，可以省去滑鼠點來點去的繁瑣步驟，很適合用來一次處理大量的圖片。-unsharp參數在Eric Jeschke [4] 的文章裡有很詳細的解說，以我們所使用的銳化參數為例:\n\n-unsharp 1x0.55+1.5+0.002\n\n所使用的四個數字分別是Gaussian Mask的Radius(每個像素周圍列入銳化計算的像素範圍)、Sigma(Gaussian遮罩的半高寬，或是Standard Deviation)、Amount(邊緣黑白的差距)、以及Threshold(像素間對比差異要高於這個值才會列入銳化的計算)。在Eric的文章裡提到很多Radius與Sigma的計算方式，不過我們這邊取的參數，是筆者經過多次嘗試，而得到與Flickr縮圖銳化最接近的參數，同時，銳化與縮圖也有先後次序，筆者建議先進行縮圖再銳化，因為要做到與Flickr相簿同樣的效果，先銳化時必須要大大加強銳化的強度，容易讓照片產生不自然的顆粒，同時縮圖的速度也會比較慢。再者，先縮圖再銳化也可以採用相同的銳化參數，不會受到原始圖檔尺寸大小的影響，還有就是銳化儘量只做一次，不要重覆銳化，在縮圖時進行即可，儘量保留原始未銳化的圖檔以利於日後縮圖銳化成各個解析度之用。\n看到這裡，我們對網路上所廣為流傳的許多資訊應該會更有概念，例如:\n為什麼非縮圖不可?\n1:1檢視靜態照片與1:1檢視動態影片，何者才有必要性?現今主流螢幕的解析度?\n相機所提供的高畫素，目的為何?\n鏡頭的銳利度(MTF-50)，片幅的大小(135, APS, 4/3,...)，感光元件的種類(Bayer、Foveon X3)等差異，在縮圖的情況下是否還能夠呈現?\n數位相機的總畫素平均遠高於Full HD(1080p)的解析度，因此錄影的影像品質會不會受到縮圖(down sample)方式極大的影響?\n您有沒有在網路上見過高檔，大片幅相機拍攝的數位照片，清晰度竟然比一般DC還差?\n您有沒有遇到過片幅比較大的數位相機，其錄製的影片清晰度竟然比片幅小的數位相機還低?\n數位照片是否都是後製過的?\n許多相機宣稱移除低通濾鏡或是AA Filter，真的是為了提升畫面銳利度嗎?\n這些問題，筆者先不作進一步說明，留給各位思考。\n接著我們將示範如何撰寫python程式來利用imagemagick實現大量自動化的縮圖銳化工作，我們的目的是將集中在一個目錄下的所有jpg檔予以縮圖並銳化，然後自動生成包含圖片連結的reStructuredText(ReST)的文章範例，換句話說，在網路文章裡插入圖片，不再需要繁複的上傳照片與拷貝連結等手續，僅需要將要包含的圖片按照順序集中在一個資料夾裡，執行程式就可以自動生成文章，照片也會依照順序排列，剩下的工作就僅是補上文字而已。同時，我們也不用擔心網站所提供的圖床會將照片品質劣化，只要事先將圖片縮好，任何網站都可以呈現出品質良好的縮圖照片。\n\n\n\n\n[1]http://www.imagemagick.org/Usage/filter/nicolas/[2]http://www.imagemagick.org/Usage/filter/#gaussian_other[3]http://gimpguru.org/Tutorials/SmartSharpening2/[4]http://redskiesatnight.com/2005/04/06/sharpening-using-image-magick/", 
      "tags": "學習與閱讀", 
      "loc": "/posts/M43/sharpen.html", 
      "title": "數位照片的奧秘"
    }, 
    {
      "text": "一天傍晚，帶小兄弟去樓下吹個涼風。\n\n\n\n\n兩人蹲在牆角研究螞蟻。\n\n\n\n對小孩來說，到處都是可以探險的地方。\n\n\n\n坐在嬰兒車上，臉很臭，因為等一下要打預防針。\n\n\n\n哥哥自從知道暫時不用打針後，每次來醫院都皮皮的。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130627b.html", 
      "title": "Photo Diary - 2013/06/27 (二)"
    }, 
    {
      "text": "母子的對話。\n\n\n\n\n\n\n\n哥哥的沙丘。\n\n\n\n\n\n\n\n\n\n\n\n\n太陽完全沈下去之時，就是我們要回家的時候了。\n\n\n\n\n\n\n\n\n\n跟沙丘說掰掰吧!\n\n\n\n哥哥依依不捨地玩水。\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n雖然全身髒兮兮的，卻是個美好的回憶。\n\n\n\n還是可以看到一些遊客，大概是因為人少，所以沙灘才能保持那麼漂亮。\n\n\n\n大家的鞋底都沾滿了沙子呢!\n\n\n\n\n\n\n\n\n\n回到之前來的隧道，這時地平線放射出彩霞，還有皎潔的月光在一旁。\n\n\n\n朝火車站前進，要回家囉!\n\n\n\n\n\n\n哥哥與弟弟的衣服已經換下來了，只有我們在等火車。\n\n\n\n還有一支蟋蟀。\n\n\n\n以後再來一次吧!", 
      "tags": "", 
      "loc": "/posts/Photo_Diary/20130711d.html", 
      "title": "孩子們的夏天 - 崎頂的沙灘與夕陽 2013/07/11 (四)"
    }, 
    {
      "text": "Python是一個程式語言，大部分的人一想到程式語言就會退閉三舍，不過幸好Python被發明出來了，她主要的對象如下:\n人類\n家庭主婦\n親子攝影人士\n投資客\n上班族\n6歲以上兒童\n超級駭客\nGoogle程式設計師\n加州理工學院(CalSci)應用數學系的Charlie Eppes教授\nFBI\nSkynet\n任何需要寫作業的學生\n任何需要出作業的老師\n任何需要寫程式的人\n任何不需要寫程式的人\n由上可知，我實在是想不出什麼理由不應該學Python，基於如此強大的理由，只好硬著頭皮學了。至於Python能用來做什麼，下面這個圖片可以說明。\n\n\nimport antigravity就可以飛起來了。\n\n\n使用Python的人有什麼不同呢?\n\n\n\n如果要分類的話，Python就像...\n\n\n\nPython並不單單是個語言，他是個人生哲學，充滿反璞歸真的隱喻:\n\nThe Zen of Python (Tim Peters)\n• Beautiful is better than ugly.\n• Explicit is better than implicit.\n• Simple is better than complex.\n• Complex is better than complicated.\n• Flat is better than nested.\n• Sparse is better than dense.\n• Readability counts.\n• Special cases aren't special enough to break the rules.\n• Although practicality beats purity.\n• Errors should never pass silently.\n• Unless explicitly silenced.\n• In the face of ambiguity, refuse the temptation to guess.\n• There should be one-- and preferably only one --obvious way to do it.\n• Although that way may not be obvious at first unless you're Dutch.\n• Now is better than never.\n• Although never is often better than *right* now.\n• If the implementation is hard to explain, it's a bad idea.\n• If the implementation is easy to explain, it may be a good idea.\n• Namespaces are one honking great idea -- let's do more of those!\n\n中文大意是說:\n\n• 美麗優於醜陋，明講好過暗諭。\n• 簡潔者為上，複雜者次之，繁澀者為下。\n• 平舖善於層疊，勻散勝過稠密；以致輕鬆易讀。\n• 特例難免但不可打破原則，務求純淨卻不可不切實際。\n• 斷勿使錯誤靜靜流逝，除非有意如此。\n• 在模擬兩可之間，拒絕猜測的誘惑。\n• 總會有一種明確的寫法，最好也只有一種，\n• 但或須細想方可得。\n• 凡事雖應三思後行，但坐而言不如起而行。\n• 難以解釋的實作方式，必定是壞方法。\n• 容易解釋的實作方式，可能是好主意。\n• 命名空間讚，吾人多實用。\n\n古詩裡也可以找到她的蹤影[1]\n\n• 妍優於寢 喻莫如敘\n• 是故簡勝繁 繁勝亂\n• 平舖勝汲營 綿密不如疏俊\n• 唯平易而已\n• 無例外於其例 不獨清於實際\n• 毋默於誤 其惡非務\n• 寧戚戚於尋徑 勿揣揣於模稜\n• 道謀於一 荷以得矣\n• 力行者宜立行於當下 利行者長三思而後行\n• 不可說之說不可說 可以道之道可以道\n• 名域鳴於域 可取\n\nLet's do more Python!!!\n\n\n\n\n[1]Aguai.", 
      "tags": "自由的程式人生", 
      "loc": "/posts/Coding/python_comic.html", 
      "title": "I'm flying - Python"
    }, 
    {
      "text": "媽咪煮晚餐時，就是兄弟倆看影片的時間，最近是看朵拉與森林救難隊。\n\n\n\n\n這是在看卡通，絕對不是在罰跪喔~~\n\n\n\n這兩個卡通特別的地方是會要求小朋友跟著一起作動作，不過有時他們屁股釘在地上時，我就要跟著作動作帶動他們，以防他們進入電視催眠狀態。\n\n\n\n看你們那麼認真，幫你們弄個小沙發吧!\n\n\n\n立刻又進入無雜念的狀態，這就是卡通的魔力嗎?(明明自己也很喜歡看...)", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130627a.html", 
      "title": "Photo Diary - 2013/06/27 (一)"
    }, 
    {
      "text": "回家的路上，看到的風景，遠方好像在下雨。\n\n\n\n\n最近中午實在是熱到不行，但是大氣對流旺盛，常常有很漂亮的雲浮現在枝頭上。\n\n\n\n剛好樹林缺一腳，就由這團雲來填補吧!\n\n\n\n騎車回家時，等紅綠燈時，快速地抓起相機近距離拍攝。\n\n\n\n換個角度，下方天黑黑了喔~\n\n\n\n從天際竄起的雲。\n\n\n\n睡蓮總是出淤泥而不染。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130622d.html", 
      "title": "Photo Diary - 2013/06/22 (四)"
    }, 
    {
      "text": "兩小無猜。\n\n\n\n\n開始搞笑，這是在演鐵達尼嗎?\n\n\n\n兩兄弟在笑什麼呢?\n\n\n\n唉呦~~怎麼跑一隻手來?(媽咪在竊笑)\n\n\n\n愛玩搖搖馬的弟弟。\n\n\n\n最喜歡溜滑梯的哥哥。\n\n\n\n最後比個招牌姿勢吧！", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130622.html", 
      "title": "Photo Diary - 2013/06/22 (三)"
    }, 
    {
      "text": "去常吃的麵店，等待麵上桌。\n\n\n\n\n吃完帶他們去附近散個步。\n\n\n\n看到什麼特別的東西嗎?\n\n\n\n古木參天。\n\n\n\n咦，我的麵麵來了~~", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130622b.html", 
      "title": "Photo Diary - 2013/06/22 (二)"
    }, 
    {
      "text": "一天下午，帶他們去樓下散步，每次看到這個角度，就開始想像他們長大的樣子。\n\n\n\n\n頭髮還留有小時候爆炸頭的痕跡。\n\n\n\n最近弟弟愈來愈會講話了，因此兄弟間的對話愈來愈多，也愈來愈有趣。\n\n\n\n跟哥哥比起來，弟弟特別黏媽咪，不過偶爾也會湊到我旁邊叫我一聲「把拔啊~~」\n\n\n\n中午去吃飯看到的雲，心情真好。\n\n\n3D奇遇記\n自從看了環太平洋的預告，心裡的宅男成份就一直蠢蠢欲動，老婆昨天自願幫我顧小孩，讓我可以去電影院一償宿願，真是太感謝老婆了。\n說來有點不好意思，自從有了小孩，就很少去電影院看電影了，上一次是跟老婆去看李奧那多的劇情科幻片「全面啟動」，而昨天是我第一次觀看3D(與IMAX)的電影，帶著悲壯的心情一個人來到電影院，在一堆情侶中坐下來，頭一個小時真是讓我讚嘆不已:「喔喔喔喔~這就是3D!!??」，音效也超級震憾，不過一小時過後，我的眼睛開始無法聚焦，環繞音場不斷轟炸我的耳朵與骨頭，3D特效讓我覺得眼睛前面一直有類似蒼蠅的東西飛過來(笑)，然後開始變成4D特效(畫面旋轉中)，加上冷氣超冷，電影看完了，回到家躺在椅子上頭痛了一整天，感覺腦細胞好像死掉一大半，耳朵也有快要重聽，不斷翁翁作響的感覺。當我形容給老婆說，電影看到最後，感覺像是坐在那裡，然後一個拳擊手一直轟擊我的臉，她快笑死了，在電影院還看到一位阿公帶著孫子來看，看到阿公頻頻把3D眼鏡摘下來揉眼睛，真替他捏一把冷汗，我想我的宅男成份已經慢慢離我遠去了吧?(泣)。\n至於環太平洋的劇情，其實現在也想不太起來演了什麼(反而是山寨片「環大西洋」過於荒繆的劇情現在還歷歷在目)，我想這或許是感官刺激過度的後遺症，說真的，電影散場後，我只有一個疑問：「電影這樣放映真的好嗎?」(雖然也有非3D版就是了..)，講求震憾到快耳聾的音效，暈眩到眼睛快脫窗的3D視覺特效，將所有感官刺激放到最大，或許是年紀增長的關係吧!也或許是第一次接觸3D電影，兩個小時的放映時間讓我覺得有點刺激過度，看完整個人快虛脫了，如果說現在的人能夠習於這樣的聲光效果，也有可能代表感覺需要麻木到一定程度才能接受這樣的刺激吧!?\n寫到這裡突然想起一個題外話，自從減少外食，在家吃晚餐後，漸漸的我跟老婆的口味也開始改變了，從原本吃辣，吃鹹，到現在一點辣一點鹹就受不了，原來我們的味覺長期以來受到這些調味料的影響，多少已經有點麻木，所幸在家開伙的頻率增加後，那些失去的味覺慢慢找回來，也慢慢品嘗出菜的原味，過了一陣子，再去買外面的東西來吃，才發現食物的原味被大量的鹽巴，辣椒與香料覆蓋過去了，已經品嘗不出食物本身的味道。我想現代的文明病，恐怕要多增加「感覺麻木」這一項吧!想想以前有很多令人感動的音樂，文學，電影，甚至是遊戲(Dos Games)，到現在演變成排場越來越大，但是能觸動人心的卻愈來愈少，以後小孩子長大了，應該也會接觸這些感官刺激的東西，不過在這之前，還是努力地培養他們對事物敏銳的感覺吧!\nPS.日後若有機會能在電視或DVD上看「環太平洋」的話，我一定會好好把他再看一次，而且是跟全家一起在家裡看，螢幕不大，音量適中，樂趣應該是不減。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130622a.html", 
      "title": "Photo Diary - 2013/06/22 (一)"
    }, 
    {
      "text": "媽咪揹著哥哥，玩起飛飛飛的遊戲。\n\n\n\n\n小心翼翼地在草地上走著的弟弟。\n\n\n\n來玩老鷹抓小雞的遊戲吧!\n\n\n\n歸途中天邊的一朵棉花糖。\n\n\n\n天色漸暗，差不多該回家吃飯囉!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130616d.html", 
      "title": "Photo Diary - 2013/06/16 (四)"
    }, 
    {
      "text": "弟弟的接球姿勢。\n\n\n\n\n不過常常變成接滾地球。\n\n\n\n這個角度，感覺好像是小大人了，真的是長大了啊!\n\n\n\n時間真的過得很快，小孩的這個時刻可能以後都很難看到了。\n\n\n\n就把這個光景永遠紀錄下來吧!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130616c.html", 
      "title": "Photo Diary - 2013/06/16 (三)"
    }, 
    {
      "text": "夕陽西斜，享受河畔風光。\n\n\n\n\n青青綠草，還有凝視的童顏。\n\n\n\n跑啊~~\n\n\n\n弟弟跟我一起跳吧!\n\n\n\n傍晚徐徐涼風，來玩球吧!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130616b.html", 
      "title": "Photo Diary - 2013/06/16 (二)"
    }, 
    {
      "text": "假日帶哥哥去買東西，路過遊樂場，讓哥哥活動一下。\n\n\n\n\n公園裡沒什麼人，因為正值中午，不過其實我們只待一下下而已。\n\n\n\n哥哥堅持每個器具都要玩一遍，才肯心甘情願離開。\n\n\n\n以前都要抱他才上得去，沒想到這一次他一下子就自己爬上去了，真的是長大了。\n\n\n\n正在專心看著石頭底下一列長長的螞蟻搬運工。\n\n\n\n要離開之前，突然心血來潮，來拍一下漂浮照片吧!\n\n\n\n雖然不是跳得很高，但是比Ya的神情卻很認真呢!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130615.html", 
      "title": "Photo Diary - 2013/06/15"
    }, 
    {
      "text": "這次回到媽咪的母校，純樸的校舍跟操場，來放風箏囉!\n\n\n\n\n弟弟使盡力氣用力跑，不過風箏只飛一下下。\n\n\n\n哥哥酷酷的太陽眼鏡(跟姊姊借的)。\n\n\n\n天氣還是很好。\n\n\n\n不過要回去的那一天驟雨，雨水像傾洩一樣下個不停。\n\n\n\n屋簷滴下好多水，弟弟伸手去接。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130608b.html", 
      "title": "Photo Diary - 2013/06/08 (二)"
    }, 
    {
      "text": "端午節回娘家過節，在路口拍的，車很少，天空很高，雲很漂亮。\n\n\n\n\n帶小朋友們到表姊的幼稚園玩。\n\n\n\n大家都愛的溜滑梯。\n\n\n\n大概是曬得有點燙，弟弟有點不想爬上去玩。\n\n\n\n噢噢噢~起風了，可惜小時候的爆炸頭已經剪掉了，不然就可以看到秀髮飄逸的模樣了。\n\n這次端午節回娘家，因為是以輕便為主，臨走前抓了GX1就出發，結果一直到回家，電力都還很足夠(拍了一張半的記憶卡)，背在身上到處跑，隨時隨地都可以拍，使用了將近兩年，幾乎都是零瑕疵的運作，也因為這樣，才能持續紀錄自己與家人的生活。我也沒想過有一天我竟然也會把拍照當作興趣之一，或許這是有了小孩之後所必經的路吧！", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130608a.html", 
      "title": "Photo Diary - 2013/06/08 (一)"
    }, 
    {
      "text": "小時候最喜歡在電扇前面唱歌了，兄弟倆也是，雖然五音不全，但是非常投入。\n\n\n\n\n放假時，讓媽咪輕鬆一下，去麵店吃午餐囉!\n\n\n\n不知道是看到我的臉上有什麼東西，突然做出很搞笑的表情。\n\n\n\n店面的音響開好大聲喔!!\n\n\n\n咦~~等一下有冰淇淋可以吃??\n\n\n\n路過看到的流浪動物認養會場，真是讓人懷念啊~一群年輕人正賣力的推銷認養的狗狗，但是停留下來的路人卻不多。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130602.html", 
      "title": "Photo Diary - 2013/06/02"
    }, 
    {
      "text": "鯨魚船，出發囉~\n\n\n\n\n弟弟快上來吧!這裡還有座位。\n\n\n\n這樣感覺有比較涼快點。\n\n\n\n航向未知的世界，我是鯨魚王~~\n\n\n\n喔喔~~嗎咪大怪獸出現，要翻船了啦~", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130601c.html", 
      "title": "Photo Diary - 2013/06/01 (三)"
    }, 
    {
      "text": "烈日裡的水龍頭藏著清涼啊!感覺小孩長好快!不久之前還是那個什麼事都要大人幫忙的小伙子，現在已經愈來愈能自理許多事了。\n\n\n\n\n最近迷上了吹泡泡，不過弟弟還不太會吹，吹完第1口，泡泡水就灑了一地。\n\n\n\n哥哥愈吹愈好囉!這時弟弟在一旁失控中，因為他的泡泡水全倒光了。\n\n\n\n吹完泡泡去活動一下筋骨，這是剛蓋好的溜滑梯。\n\n\n\n雖然已經接近日幕，陽光還是蠻強烈的，幾個星期都是這樣，這就是夏天啊!!\n\n出外踏青，記得要多補充水份喔!為了不讓他們整個夏天都關在屋內，我們尋找了一些防曬的工具，其實關在屋內一樣悶熱，血液循環也不好，不如做好防曬，到戶外透透氣，找個涼亭休息一下也不錯，多補充水份，也能訓練他們對熱的適應力與身體熱循環的能力，總比一直吹冷氣，一到外面就中暑好 (不過冷氣吹得最多的似乎是我啊!...)。現在只要有空，我也會在傍晚超慢跑個兩三圈，汗流夾背一下，中暑頭痛的頻率好像有慢慢減輕了，果然身體是要鍛鍊的。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130601b.html", 
      "title": "Photo Diary - 2013/06/01 (二)"
    }, 
    {
      "text": "兄弟倆正在專心觀察虎尾草，專注的神情其實是最棒的表情了。\n\n\n\n\n看到河邊有夜鷺棲息，哥哥也不禁打開雙臂幻想自己在飛翔。\n\n\n\n弟弟常常走一走就停下來，東看西看。\n\n\n\n出去玩，有時難免會這裡太熱，那裡太髒，不過現在我們都儘量耐著性子，畢竟小孩自己也有調節的能力，只要記得多補充水份，玩完了記得洗手就好。\n\n昨天蘇力颱風剛過境，家裡停電了一整天，下午帶他們去中庭踏踏水，晚上點了蠟燭吃燭光晚餐，然後早早在遊戲室裡鋪了床，全家一起在窗戶旁納涼入睡，對兄弟倆來說應該是個難忘的經驗吧!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130601a.html", 
      "title": "Photo Diary - 2013/06/01 (一)"
    }, 
    {
      "text": "這是每天路上都會經過的水池，雖然很小，但是卻有很細微美妙的風景。\n\n\n\n\n有時對於未來產生迷惘，抬起頭來，似乎看到了方向。\n\n\n\n每天出門必打招呼的喵咪，是一隻很親人的貓，但是最近很少看到她了。\n\n\n\n奮力綻放的睡蓮，每次經過時都忍不住按下快門，世界有很多美好的事物，只是我們都忘記停下來欣賞。\n\n\n\n猶如一盞明燈無視環繞的黑暗。\n\n\n\n中午外出，抬頭一看，發現光線在樹葉的縫隙間尋找出路。\n\n\n\n今日兄弟倆的合照，他們正在把烤箱的隔熱手套套在腳上 (難怪最近出爐的自製麵包都有腳汗味...)。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130531.html", 
      "title": "Photo Diary - 2013/05/31"
    }, 
    {
      "text": "愛吹泡泡的James，與留在地上未破掉的泡泡。\n\n\n\n\n再來吹一次。\n\n\n\n路上盛開的花朵，兄弟倆正好奇的觀看著。\n\n\n\n太陽就算再怎麼熱烈，花朵還是奮力地綻放。\n\n\n\n一搭一唱地搞笑著。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130524.html", 
      "title": "Photo Diary - 2013/05/24"
    }, 
    {
      "text": "在夜市那邊舉辦的園遊會，兄弟倆第一次看見真正的馬兒。\n\n\n\n\n樓下的喵咪所生的小喵咪。\n\n\n\n母子合照一張。\n\n\n\n去園遊會那裡買的氣球，玩得樂此不疲。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130518.html", 
      "title": "Photo Diary - 2013/05/18"
    }, 
    {
      "text": "這是兄弟倆第一次玩吹泡泡，兩人非常新奇地追著泡泡跑。\n\n\n\n\n其實泡泡的配方網路都查得到，用點膠水以及洗髮精就可以製造出泡泡水喔。\n\n\n\n雖然很想拍出夢幻的照片，不過畢竟場景有限，只好用點想像力啦~\n\n\n\n還不太會吹泡泡的Shannon，只能用腳踩泡泡過過癮。\n\n\n\n最近兩人迷上狗狗與猩猩大冒險，真是大人與小孩都適合看的節目啊。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130513.html", 
      "title": "Photo Diary - 2013/05/13"
    }, 
    {
      "text": "Shannon最喜歡把玩具丟到桌子上，然後再爬上去撿回來。因此每一次都要耐著性子把他請下去。\n\n\n\n\n這年紀真的什麼都可以玩，什麼都想玩，雖然調皮，但也是最可愛的時期。\n\n\n\nJames比較大了，只要有玩具他就很高興，只是弟弟只能在旁邊撿他不要的玩。\n\n\n\n偶而Shannon也會很一本正經的想要告訴我們什麼，例如這時他正努力跟我解釋這個是蕉蕉，一邊「阿恩」地表演給我看。\n\n\n\n兄弟倆的笑點都很低，只要一點小事或做個怪表情就會笑個不停，雖然讓人心情很好，可是這樣一直笑下去，笑到眼淚跟汗滴都流出來了，沒問題吧?", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130511.html", 
      "title": "Photo Diary - 2013/05/11"
    }, 
    {
      "text": "太陽己經接近地平線了。\n\n\n\n\n\n\n\n\n\n\n兄弟倆堆起沙來。\n\n\n\n彷彿是兩個世界交錯般，沙灘與倒影。\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n哎呀~~才剛堆好就被海浪沖垮了。\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n哥哥直接一屁股坐在沙子上面。\n\n\n\n\n\n\n弟弟又失控了，因為他剛堆好的沙丘被沖垮了。\n\n\n\n讓人覺得有點好笑的一幕。\n\n\n\n\n\n\n\n\n\n哥哥可是玩得非常高興呢!\n\n\n\n弟弟沒關係，我來幫你蓋沙丘。\n\n\n\n夕陽落入地平線的一幕。", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130711c.html", 
      "title": "孩子們的夏天 - 崎頂的沙灘與夕陽 2013/07/11 (三)"
    }, 
    {
      "text": "母子三人朝大海奔去。\n\n\n\n海、天、還有沙灘都染成橘紅色。\n\n\n\n遠方有個觀海台，不過應該是沒有開放。\n\n\n\n\n\n\n太陽已經愈來愈沈，趁著光輝還在，母子盡情地玩水。\n\n\n\n弟弟走著走著，一不小心跌坐在水裡，整個褲子都溼了。\n\n\n\n不過我們有帶換洗衣物，索性就讓他們盡情的玩水。\n\n\n\n波浪一陣陣打來，波光閃閃。\n\n\n\n弟弟失控中，因為他的褲子都溼掉了。\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n就讓照片靜靜地傳達當時的景色吧!", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130711b.html", 
      "title": "孩子們的夏天 - 崎頂的沙灘與夕陽 2013/07/11 (二)"
    }, 
    {
      "text": "海天，沙灘，還有巨型風力發電機，就是我們要去的地方。\n\n\n\n\n崎頂火車站到站後只有我們下車，旁邊有個觀海的景台，感覺是一個真正遠離塵囂的地方。\n\n\n\n說要拍個照留個紀念，但是卻擺這樣的姿勢...。\n\n\n\n忘了說，除了風力發電機，這裡也是看火車的好地方，因為火車站與沙灘只隔著防風林。\n\n\n\n特地挑接近傍晚的時間去，此時陽光已經不是那麼強烈，還有涼爽的海風。\n\n\n\n風力發電機與海鷗，這也是我第一次看到的景象。\n\n\n\n空氣很清爽，而且最重要的是，除了海浪聲，一切都很安靜，彷彿能聽到巨型風扇靜靜轉動的聲音。\n\n\n\n觀景台下方有個森林隧道，非常漂亮，但是由於接近黃昏，光線變得有點暗，天氣好時走這個步道應該是非常舒服的一件事，後來才知道，繼續走下去就會到子母隧道。\n\n\n\n往相反方向前進，會到以前的崎頂海水浴場，這是會經過的隧道，馬路很寬，稍微注意一下車子，哥哥正在玩影子的遊戲。\n\n\n\n穿過隧道後的一條國道，正對面就是已經封閉的崎頂海水浴場，不過我們的目的地是沙灘啊!\n\n\n\n經過一連串探路與問路，好不容易終於在一個自行車專用步道旁看到停了好幾台車，直覺到這裡就是沙灘的入口，喔耶~沙灘到了喔!!先前找路走到腳酸，現在突然振奮起來了。\n\n\n\n這對我來說是像夢一樣的場景，弟弟的倒影清楚可見。如果把照片倒過來可是很有趣的呢!\n\n\n\n剛好趕在夕陽快落下地平線時到達，小心翼翼前進的弟弟。\n\n\n\n媽咪跟哥哥已經先到前面去了，兩個人一整個就是往海裡飛奔。\n\n\n\n夕陽，剪影，與嬰兒車的倒影。\n\n\n\n遠遠望著哥哥與媽咪，弟弟似乎有點不知道該如何是好。\n\n\n\n金黃色的沙灘與天空，沒有人潮的喧鬧，只有海浪的寧靜。\n\n\n\n大概是封閉很久的關係，沙灘非常乾淨，可以看到很多小螃蟹跑來跑去，偶爾有兩三個遊客也跟我們一樣來看夕陽。\n\n\n\n不遠處壯觀的風力發電機，正在夕陽的映照下緩緩地旋轉著。\n\n我很早就下定決心，帶孩子們出去玩時不去人擠人的地方，多接近大自然，以在地與大眾運輸工具為主，不過大概是太少出遠門，經驗還是不太足夠，這次衝去崎頂並沒有準備很充足，還差點迷路，幸好路上有不少熱心的當地居民，我們也索性發揮探索精神，一路逢人就問，崎頂海水浴場關閉很久了，因此出發前我們也不是很確定到達沙灘的機率高不高，幸好最後關頭，看起來像是海水浴場工作人員的人好心的替我們指路，大概連他們也很奇怪怎麼會有人來到這個毫無人煙的地方吧!?崎頂這個地方，連書上都只有少少的篇幅提供過時的資訊，所以這次真的是老天眷顧。總之，帶著堅強要去海邊的信念，我就這樣攜家帶眷衝了!!", 
      "tags": "孩子們的夏天", 
      "loc": "/posts/Photo_Diary/20130711a.html", 
      "title": "孩子們的夏天 - 崎頂的沙灘與夕陽 2013/07/11 (一)"
    }, 
    {
      "text": "問題\n假設一個黑盒子(black box)是一個線性系統(LTI,Linear time invariant)，已知他的operator特性為\\(g(t''), t''=0 \\rightarrow \\infty\\)\n，亦即當我們用隨時間輸出的單位脈衝電流\\(\\delta(t'')\\)\n輸入這個black box(因為是單位脈衝unit impulse，所以每個脈衝大小均為1，所量到的輸出對應電流即為\\(g(t'')\\)\n。\n\n現在我們已經知道這個黑盒子對時間的operator特性，如今我們要量測一個待測物體，他的輸入電流是\\(f(\\tau)\\)\n，其中\\(\\tau=0\\rightarrow t\\)\n，則他的輸出電流\\(y(t)\\)\n會是如何呢?\n首先，線性系統在時間t前的輸出是具有疊加性的，也就是t時間前的電流輸出疊加起來，假設f的時間尺度0到t的t時剛好和g(t\")的t\"時相同，即t\"=t，因此\\(y(t)\\)\n相當於在t\"的時間\\((t-\\tau)\\rightarrow t\\)\n的訊號疊加，因為f可能是從g的某一段插入進去的，因此以t=t\"時為參考點倒推 ,在\\(t''=t-\\tau\\)\n時的電流輸出應該為\\(\\delta(t'')\\)\n的\\(f(\\tau)g(t-\\tau)\\Delta\\tau\\)\n倍，也因為這個\\(\\Delta\\tau\\)\n的出現(即計算面積)，故回到t時間前的訊號疊加，可以寫成積分式\n\n\\begin{equation*}\ny(t)\\equiv{f*g}=\\int{t}_{0}f(\\tau)g(t-\\tau)d\\tau\n\\end{equation*}\n\n由此可以知道convolution有moving integral的概念，同時也是藉由輸入單位衝量函數以預測一個線性系統下任意函數的輸出值!\nf(t)與g(t)的convolution寫成f(t)*g(t)，其Fourier Transformation為其個別Fourier transformation的product\nf(t)*g(t)==>Fourier Trans==>F(w)G(w)\n\n\nConvolution Theorem\n如果寫成\\(Corr(f,g)\\equiv \\int{t}_0 f(\\tau+t)g(\\tau)d\\tau\\)\n則為Correlation:\nCorr(f,g)的Fourier Trans==>\\(F(\\omega)G*(\\omega)\\)\n\n\n\nCorrelation Theorem\n如果f=g就是autocorrelation\nCorr(g,g)的Fourier Trans==>\\(|G(\\omega)|2\\)\n，即是Power Spectral Density(PSD)\n\n\nWiener-Khinchin Theorem\nParseval's theorem(怕什麼定理)說，對所有時域跟頻域的積分所得的total power應該要一樣。\n即Total Power \\(\\equiv \\int{\\infty}_{-\\infty}|g(t)|2 dt=\\int{\\infty}_{-\\infty}|G(\\omega)|2 d\\omega\\)\n。\n大致上是這樣。", 
      "tags": "mathjax,學習與閱讀", 
      "loc": "/posts/Learning/convolution.html", 
      "title": "Convolution(摺積)的物理意義"
    }, 
    {
      "text": "感謝Happyspirit兄二話不說大力相助，提供這三張測試照片，分別是採用Foveon X3的Sigma DP2 Merrill (DP2M)[1]，採用一般常見的Bayer [2]排列live MOS [3]的Panasonic GH2搭配20mm F1.7餅乾鏡，以及具有Ultra Pixel [4]感光元件的智慧型手機HTC New One，這三台性格迥異的相機正好讓小弟實驗縮圖情況下不同感光元件所呈現的差異，由於每台相機的自動白平衡有些許差異，使用的鏡頭也不同，因此我們將重點放在畫面的中心部位的清晰度，也就是理論上最能夠呈現照片解析力的地方，以下是這三張圖片，經過一般的銳利化過程，也就是我們先前所使用Flickr銳化參數所得到的成品。\n\n\nDP2M測試照，原始圖檔的尺寸為4704x3136(3:2)。\n\n\n\n\nGH2測試照，原始圖檔的尺寸為4976x2800(16:9)。\n\n\n\nHTC New One測試照，原始圖檔為2688x1520(16:9)。\n\n裁切出中心部位後，我們先來看1:1檢視的部份:\n\n\nDP2M 中央以1:1呈現，未經縮圖與銳化。\n\n\n\nGH2 中央以1:1呈現，未經縮圖與銳化。\n\n\n\nNew One 中央以1:1呈現，未經過縮圖與銳化。\n\n為了方便比較，我將縮圖銳化的中央裁切部位放在一起，圖中所指的一般銳化為先前提到的Flickr銳化標準參數:\n\n-unsharp 1x0.55+1.5+0.002\n\n而加強銳化的參數為:\n\n-unsharp 1x0.72+1.5+0.002\n\n這裡我們分成兩階段測試，如下圖\n\n\n先裁切出中央花樣的部份，然後再縮圖銳化至800px\n\n\n\n先將原圖縮圖至800px，然後裁切出中央花樣的部位。\n\n最後我們將套用加強銳化參數的GH2與New One照片與一般銳化的DP2M照片放在一起做為總結。\n\n\nDP2M測試照，一般銳化，以800px呈現。\n\n\n\nGH2測試照，加強銳化，以800px呈現。\n\n\n\nNew One測試照，加強銳化，以800px呈現。\n\n這些測試雖然不能稱得上定性與定量，不過至少能為以下的問題提供些思考方向:\n感光元件的差異，在縮圖下是否可以分辨得出來?\n縮圖銳化的效果，有沒有可能遠大於鏡頭與感光元件，以及片幅的差別?\n為什麼要縮圖?\n是否有不後製的數位照片存在?\n必須澄清的是，筆者並不是「頂級器材無用論」的信奉者，例如這個實驗中，我們可以發現，即使清晰度藉由銳化過程達到相似的等級，部份照片的高光以及暗部細節其實喪失很多，並不利於進一步的後製與還原影像資訊，筆者認為對於高階器材正確的認知，或許不是在於畫質的保證，而是「更高的後製寬容度」，這也是目前主流觀念裡經常產生誤解的地方 ― 不管我們使用了多少位元的AD轉換，使用了多高的位元紀錄色階，使用多銳利的鏡頭與多精細的感光元件，最後的成品總是會遇到必然的限制，就是縮圖與降低位元(動態範圍)，有如湖泊有大有小，但是他們最終都只有一樣大小的出水口，因此不是所有資訊都得以保留，甚至我們可以說，愈豐富的原始Raw資料，在轉換成JPG並縮至可以觀看的照片尺寸的過程中，損失的資訊量其實是愈大的。諸如GH2或是DP2M將近1600萬畫素的JPG照片，若以300dpi輸出，能印刷至A3尺寸，遠大於正常照片所需的解析度，在我們縮圖至能夠正常觀看的大小時，其實捨棄了將近80~90%以上的畫素資訊[5]；真正能夠完整保留的，反而是照片的構圖、故事性、以及光線的運用，就這點就足以讓人重新思考所謂的畫質在數位攝影裡所代表的意義。\n\n\n\n\n[1]http://en.wikipedia.org/wiki/Foveon_X3[2]http://en.wikipedia.org/wiki/Bayer_filter[3]http://en.wikipedia.org/wiki/Live_MOS[4]http://en.wikipedia.org/wiki/Ultra_Pixel_Technology[5]以主流寬螢幕1920x1080的解析度(16:9)，約為207萬像素，因此1600萬像素(4:3或3:2比例)縮圖至螢幕可以顯示的最大範圍，將低於207萬畫素，也就是捨棄掉將近87%以上的畫素，更不用說一般在網路相簿分享的照片，是遠小於螢幕最大可顯示的範圍。", 
      "tags": "學習與閱讀", 
      "loc": "/posts/M43/resize.html", 
      "title": "感光元件的差異對縮圖的影響"
    }, 
    {
      "text": "MathJax是一個JAVA Script，他能在網頁裡顯示Latex的數學式子，不過使用上有許多要注意的地方。\n\n要讓nikola編輯的文章載入MathJax很簡單，只要在tags裡加入mathjax即可。例如:\n\n.. tags: mathjax, my_other_tags, ...\n\n然後在段落裡插入math語法，例如:\n\nThe first equation using mathjax is as following :math:`\\alpha=\\beta+\\gamma`\n\n會顯示\nThe first equation using mathjax is as following \\(\\alpha=\\beta+\\gamma\\)\n\n或是使用以下語法獨立顯示數學式子於一行:\n\n.. math::\n\n   \\int \\frac{dx}{1+ax}=\\frac{1}{a}\\ln(1+ax)+C\n\n則如下\n\n\\begin{equation*}\n\\int \\frac{dx}{1+ax}=\\frac{1}{a}\\ln(1+ax)+C\n\\end{equation*}\n\n根據conf.py的設定，可以決定上式置中或是靠左，我是選擇置中，這樣看起來比較不會跟上下段落擠在一起。\n可惜的是Vst (VIM)還無法支援，轉PDF時的數學式子方案還要再研究一下。\n這裡有個小插曲，第一次使用MathJax時發現數學式子只有FireFox表現最為正常，其他瀏覽器都無法正常載入MathJax，檢查一下原始碼，發現是因為用了MathML(只有FireFox原生支援)，Google Chrome使用者必須額外安裝MathJax for Chrome,才能正常顯示數學式子了，更不用說其他如IE，safari, opera等，應該都是無法正常顯示吧？如果用html-ccs的方式，則可以繞MathML的相容性，html必須包含:\n\n<div class=\"math\">\n\\begin{equation*}\n\\int \\frac{dx}{1+ax}=\\frac{1}{a}\\ln(1+ax)+C\n\\end{equation*}\n</div>\n\n而如果是使用MathML，在html檔是這樣的:\n\n<div>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" mode=\"display\"><mtable><mtr><mtd><mo>∫</mo><mfrac><mrow><mi>d</mi><mi>x</mi></mrow><mrow><mn>1</mn><mo>+</mo><mi>a</mi><mi>x</mi></mrow></mfrac><mo>=</mo><mfrac><mrow><mn>1</mn></mrow><mrow><mi>a</mi></mrow></mfrac><mo>ln</mo><mo>(</mo><mn>1</mn><mo>+</mo><mi>a</mi><mi>x</mi><mo>)</mo><mo>+</mo><mi>C</mi></mtd></mtr></mtable></math></div>\n\n因此稍微看一下html原始碼就能知道是使用何者，很多人遇到顯示不正常的問題，通常是因為html內容採用後者，很明顯的第一種顯示方式最簡單漂亮，相容性也最廣，花了一個晚上嘗試，發現在安裝doit，docutils，mako等套件時，不能使用官方的套件，必須使用從nikola下載的套件，因為他們有針對nikola修改，因此最保險的方法就是將官方套件一個個移除後，重新使用:\n\nsudo pip install https://github.com/ralsina/nikola/archive/master.zip --upgrade\n\n--upgrade參數會一個個檢查子套件並更新；更新後，重build一次rst文件就能夠以第一種型式顯示數學式子，在Chrome裡也完全正常!!推測其他瀏覽器應該也是OK!\n雖然耗費一個晚上才找出解決方案！但是成就感滿滿，因為我知道每次的解決問題，都可以受用無窮呢！\nHappy Hacking！", 
      "tags": "mathjax,學習與閱讀", 
      "loc": "/posts/Learning/mathjax.html", 
      "title": "使用MathJax與Latex數學"
    }, 
    {
      "text": "蹲下來看路邊的小昆蟲。\n\n\n\n\n只要不是在車水馬龍的地方，就讓哥哥牽著弟弟的手。\n\n\n\n哥哥腳程比較快，弟弟幾乎是用跑的跟在後面。\n\n\n\n沒幾分鐘，哥哥就自己跑到前面去了。\n\n\n\n等等我啊~\n\n\n\n我跑累了，在清涼的飲料店裡休息一下吧!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130525.html", 
      "title": "今日Photo Diary - 2013/05/25"
    }, 
    {
      "text": "這張貓不是NL10拍的，只是用來充充版面。這是我家樓下的流浪貓，每天出去時都會跟他打個招呼。\n\n一直想嘗試微距攝影，但是又不想花太多錢，因此把目標鎖定在NL10近攝片，剛好看到網拍有人在出清二手B+W NL10近攝片，就被我以蠻低的價格入手了，品項雖然很不錯，但是我馬上發現這個近攝片的缺點―無法裝鏡頭蓋(好像應該早點發現啊~)，這讓我在使用時有點困擾，因為很怕鏡頭在相機包裡沾棉絮或刮傷，所以實際能拿出來使用的機會幾乎是零，就這樣放在相機包裡帶出去了好幾個星期，直到有一天我告訴自己「不能再這樣下去了」；於是趁中午外出時，將相機掛在脖子上，裝上NL10試拍幾張。\n\n\n\n所謂的近攝片，其實就相當於鏡頭前裝個凸透鏡一樣，所以邊緣的部份會有明顯的像差，因此要儘量將對焦點固定在中央。\n\n\n\n這張也不是NL10拍的，只是因為那天他可以讓我很靠近，所以也是用來充版面。\n\n\n\n由於邊緣像差的關係，拍攝的技巧是將主題固定在中間，事後再裁切，將像差部份的部份裁掉，也就是先拍攝後構圖的方式。\n\n\n\n微距攝影最有趣的地方就是可以拍到平常不容易注意到的小細節。不過近攝片會讓鏡頭的焦距大大縮短，因此最近跟最遠對焦距離都在5cm以內，是個不小的限制。\n\n\n\n中場休息時，坐在椅子上看到的光景，順手拍了下來。\n\n\n\n看著兩個小孩玩耍，我發現我還是比較喜歡照小孩，微距攝影可能要等我解決了鏡頭蓋的問題，不過我還是天天帶這個近攝片出門。\n\n\n\n這讓我想起了小時候，我也常常跟同學們一起去探險，這種自由探索的樂趣，在又是手機，又是網路的現代生活裡應該是愈來愈少見了吧？\n\n近攝鏡是微距攝影裡最便宜的方案，他的畫質也是比較多人詬病的，其實拍攝時只要掌握「將主題對焦在畫面中央，之後再裁切掉像差的部位」，也是可以拍出效果不錯的照片，而所謂的像差，是指影像出現疊影、紫邊等問題，在畫面的邊緣尤其明顯，只能儘量將其捨棄掉，同時，對焦的距離也有很大的限制，一定得貼近被攝物拍攝，不過換個角度想，由於出門只要多帶個濾鏡般大小的鏡片(還是有點重量，因為是玻璃材質)，已經比攜帶一顆微距鏡輕便太多，同時彈性也比較大，可以透過轉接環接在任何鏡頭上，對於偶爾想拍拍微距的人來說，應該是個很不錯的方案，如果能有個鏡頭蓋就更完美了。", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130512.html", 
      "title": "NL10與14-45mm隨手寫真 - 2013/05/12"
    }, 
    {
      "text": "帶James出去買午餐時，途中橋面正在施工，我跟他停下來目不轉睛地看著怪手在河面上來來往往。\n\n\n跟怪手合影，唔，看不是很清楚。\n\n\n\n\n特地拍一張施工全貌，話說那個在操作的人大概是搖桿不太靈敏，差點連人帶車掉到河裡去。\n\n\n\n看似很有趣的樣子，我當然是趕快將這個表情拍下來啦~\n\n\n\n回到家後，不停跟我問跟怪手有關的事，怪手的故事已經變成每天晚上必講的了。\n\n\n\n把拔你擋到我了啦!\n\n\n\n\n最近家裡附近經常施工，很多道路也進行美化工程，因此常常碰到被封鎖的路，帶James出來也經常要繞遠路，不過等到施工告一段落，全家人就可以多到附近走走囉!", 
      "tags": "生活日記", 
      "loc": "/posts/Photo_Diary/20130526.html", 
      "title": "好奇的造橋工程 - 2013/05/26"
    }, 
    {
      "text": "2013/05/24 更新 by 文遠爸 (Xanadu)\n沒想到時間過得那麼快，5年過去了，我們有了二個小孩，而Lucy跟我們的照片仍然放在櫃子上，只是稍微褪色了點。她對我們的影響至今仍持續著，這幾年，我們不斷回到原點，檢視著我們人生的目的，不斷地回味著Lucy所教我們的一切，她永遠都是我們家的一份子。\n2010/07/27 更新 by 吉諾 (Gino)\n此篇文章用以紀念最乖巧最溫柔的狗狗―Lucy\n\n\n\nLucy在前年(2008年)1月17日去世了。\n雖然他陪伴我和老公只有短短兩年的時間，但是卻帶給我們很深遠的影響。\n這篇是剛撿到lucy的時候，幫他做的認養文章。\n自私的想，我很高興lucy最後沒有被送養出去.....\n因為和他相處的時間是這麼短暫而且快樂！\n\n我不知道lucy的前半生是怎麼過的，很幸福嗎？很可憐嗎? 我只知道，我看到她的時候當時lucy只有16公斤，右後腳有一深可見骨的傷口，但是流不出血，也因過於瘦弱，長不出肉，傷口附近常常吸引一堆蒼蠅飛來飛去，腳也都不能正常放下走路，腹部兩側都有乳房瘤。且與人的互動是異常的冷漠......不是害怕，是冷漠!\n\n\n\n長時間的和lucy相處下來，發現經過時間的洗鍊後，她竟是這麼溫柔，個性恬靜的狗.......\nLucy是史上最溫馴的大型犬,她不會拖著您跑,也不會撲您,更不會亂叫(叫的次數屈指可數，聲音也非常小聲!),只要輕輕呼喚她就會立刻回到您身邊(即使跑遠了也可以叫得回來喔!)個性穩定,服從性高,只是年紀大了,冬天有點怕冷,記得要給他加一塊布墊喔!\n\n\n\nLucy的年紀已經不小了,所吃的苦或許不是我們能想像的,不過她既勇敢又溫柔,撐過了許多大手術,也帶給我們許多鼓舞,撿到她的時候,她全身瘦得讓人覺得可怕, 後腳也被車子撞到露出骨頭了,跛腳的她腹下更垂著兩個拳頭大的乳房瘤….\n\n\n\n(第一次看到lucy，就是這樣瘦的讓人驚訝與心疼)\n評估了醫生的建議,我們帶她去摘除了一半的乳房瘤,以及結紮,這些手術都險些要了她的命,因此最後一小塊的乳房瘤,我們決定不切除了。\n現在的她已經恢復元氣與體力,而她的腳傷,經過調養也好了,現在走路跑步都一切正常了呢!\n\n\n\n\n\n\nLucy 早年可能是繁殖場的狗，當老了生病了沒價值後，便被丟出任其流浪自生自滅。由於長期的未與人互動與與生俱來的高度穩定性，造就了Lucy不懂覓食不懂乞食 的個性，也才會讓她被我們發現時，瘦的如此嚴重....待在籠子十幾年,注定就是生狗狗生一輩子的她,眼神總是特別卑下,頭總是低低的,好像在默默地控訴 著繁殖場帶給所有狗狗的苦難,照顧一直到一兩個月後,她才漸漸開朗起來,眼神不再冷漠，而漸漸溫柔.....\n一般會認為，像杜賓這樣的狗，一定是\"猛犬\"，個性一定很兇!其實對lucy來說並不是這樣的!!她的個性跟一般的狗狗可是完全不同,您可能一輩子都找不到像這樣穩定的狗狗了,又乖巧又文靜,一付逆來順受,好像世間的一切已經對她無所謂的樣子。\n對Lucy 來說，最大的遺憾是年紀大了，身體自然多了年輕狗狗所沒有的一些病痛。但是那是因為她的青春和健康都被浪費在繁殖場和流浪中，不是Lucy的錯啊~~ 我們真的很希望可以替她找到願意照顧Lucy餘生的主人，願意無私的給lucy溫暖，讓Lucy知道，她不用再受苦了...\n照 顧lucy絕對不是輕鬆的工作。 她就像家裡年老的長者一樣，有些年老後的疾病，之後都會陸陸續續的發生，例如，尿失禁，活動力下降，容易小感冒等等。並且，您會比其他認養年輕狗狗者，更 快面臨到生離死別。其實，狗狗的死別並不可怕，因為她的最後，有我們陪在她身邊，她是很溫暖很幸福的離開的。若您真的想要照顧lucy的餘生，這些問題都 希望您能做好心理準備，準備好要去迎接lucy的挑戰，而我相信，lucy回報給您的，一定遠超過您所付出的。\n我們希望能夠替Lucy找到合適的家庭讓她養老，有幾件事項，需要先提醒想要照顧lucy的人:\n對lucy來說，到了您的新環境，是新主人要去適應lucy大部分的生活習慣，而非lucy去適應新主人。\nlucy的健康狀況，最好便是維持現狀，否則便漸漸衰老，因此醫療費用是一定會有的，請衡量哦。\nlucy相當怕冷，絕不建議養在室外。\nlucy的年事已高，且心臟不好，並不需要太大量的運動，請勿當他是大型犬就強迫他做太大量運動，平時散個五分鐘的小步就夠了。\nlucy漸漸的已出現尿失禁的狀況，請新主人多包涵。\n未來，lucy也將漸漸出現其他老年狗的健康問題，請您以最大的包容心來對待lucy。\nlucy可以活多久，我們真的不曉得。但是可以確定的是，很有可能沒有另一個10年，所以若您無法承受送別lucy，那請您勿勉強帶lucy回家哦。\n當您是符合以上條件的好主人,相信溫柔的Lucy所能帶給您的遠超過您的付出", 
      "tags": "狗狗", 
      "loc": "/posts/Dogs/lucy.html", 
      "title": "適合陪伴，個性溫柔的中大型犬―Lucy"
    }
  ]
}